<script setup>
import { ref } from 'vue';

const tab = ref(null);
const tab04_1 = ref(null);
const tab04_2 = ref(null);
const agree = ref(false);
</script>

<template>
  <v-dialog v-model="agree">
    <!-- 샘플 버튼 -->
    <template v-slot:activator="{ props: activatorProps }">
      <v-btn v-bind="activatorProps">
        개인정보 수집 및 이용 동의 팝업
      </v-btn>
    </template>
    <!-- // 샘플 버튼 -->

    <!-- 개인정보 수집 및 이용 동의 -->
    <div class="popup-wrap large">
      <div class="popup-head">
        <h3 class="h-title">개인정보 수집 및 이용 동의</h3>
      </div>
      <div class="popup-cont">
        <v-card
          flat
          rounded="0"
          class="tab-cont"
        >
          <v-tabs
            v-model="tab"
            bg-color="transparent"
            color="selected"
          >
            <v-tab value="tab04_1">NICE평가정보</v-tab>
            <v-tab value="tab04_2">KCB</v-tab>
          </v-tabs>
          <v-window v-model="tab">
            <v-window-item value="tab04_1">
              <v-tabs
                v-model="tab04_1"
                bg-color="transparent"
                color="selected"
                class="tab-list"
              >
                <v-tab value="tab04_1_1">SKT</v-tab>
                <v-tab value="tab04_1_2">KT</v-tab>
                <v-tab value="tab04_1_3">LGU+</v-tab>
              </v-tabs>
              <v-window v-model="tab04_1">
                <v-window-item value="tab04_1_1">
                  <v-card 
                    flat
                    rounded="0"
                  >
                    <v-card-text>
                      [SK텔레콤 귀중]<br>
                      본인은 SK텔레콤(주)(이하 ‘회사’라 합니다)가 제공하는 본인확인서비스(이하 ‘서비스’라 합니다)를 이용하기 위해, 다음과 같이 ‘회사’가 본인의 개인정보를 수집/이용하고, 개인정보의 취급을 위탁하는 것에 동의합니다.<br><br>
                      1. 수집항목<br>
                      - 이용자의 성명, 이동전화번호, 가입한 이동전화 회사, 생년월일, 성별<br>
                      - 연계정보(CI), 중복가입확인정보(DI)<br>
                      - 이용자가 이용하는 웹사이트 또는 Application 정보, 이용일시<br>
                      - 내외국인 여부<br>
                      - 가입한 이동전화회사 및 이동전화브랜드<br>
                      2. 이용목적<br>
                      - 이용자가 웹사이트 또는 Application에 입력한 본인확인정보의 정확성 여부 확인(본인확인서비스 제공)<br>
                      - 해당 웹사이트 또는 Application에 연계정보(CI)/중복가입확인정보(DI) 전송<br>
                      - 서비스 관련 상담 및 불만 처리 등<br>
                      - 이용 웹사이트/Application 정보 등에 대한 분석 및 세분화를 통한, 이용자의 서비스 이용 선호도 분석<br>
                      3. 개인정보의 보유기간 및 이용기간<br>
                      - 이용자가 서비스를 이용하는 기간에 한하여 보유 및 이용. 다만, 아래의 경우는 제외<br>
                      - 법령에서 정하는 경우 해당 기간까지 보유(상세 사항은 회사의 개인정보처리방침에 기재된 바에 따름)<br>
                      4. 본인확인서비스 제공을 위한 개인정보의 취급위탁<br>
                      수탁자 : NICE평가정보(주), (주)다날, (주)드림시큐리티, SCI평가정보(주), NHN한국사이버결제(주), (주)KG모빌리언스, 코리아크레딧뷰로(주), 한국모바일인증(주)<br>
                      취급위탁 업무 : 본인확인정보의 정확성 여부 확인(본인확인서비스 제공), 연계정보(CI)/중복가입확인정보(DI) 생성 및 전송, 서비스 관련 상담 및 불만 처리, 휴대폰인증보호 서비스, 이용자의 서비스 이용 선호도 분석정보 제공관련 시스템 구축·광고매체 연동 및 위탁영업 등<br>
                      ※ 수탁자의 상세 개인정보 취급 위탁 내용은 각 수탁자가 정하는 절차와 방법에 따라 수탁자 홈페이지 등에 게시된 수탁자의 개인정보 처리방침 및 제3자 제공 동의 방침 등에 따릅니다.<br>
                      5. 위 개인정보 수집·이용 및 취급위탁에 동의하지 않으실 경우, 서비스를 이용하실 수 없습니다.<br>
                      ※ 회사가 제공하는 서비스와 관련된 개인정보의 취급과 관련된 사항은, 회사의 개인정보처리방침(회사 홈페이지 www.sktelecom.com )에 따릅니다.<br><br>
                      [NICE평가정보(주) 귀중]<br>
                      NICE평가정보(주)(이하 ‘회사’)는 SK텔레콤(주)의 업무를 대행하여 휴대폰본인확인서비스를 제공함에 있어 고객으로부터 개인정보를 수집하고 이용하기 위해 ‘정보통신망 이용촉진 및 정보보호에 관한 법률’에 따라서 다음과 같이 본인의 동의를 받습니다.<br><br>
                      1. 개인정보의 내용<br>
                      가. 정보항목<br>
                      - 주민등록번호, 생년월일, 성명, 성별, 내/외국인 구분, 휴대폰번호, 가입한 이동통신사, IP주소<br>
                      나. 수집방법<br>
                      - 본인인증 요청시 회원사 서비스 페이지 또는 본인인증 팝업창 페이지에서 이용자가 직접 입력<br>
                      - 본인인증 과정에서 시스템에서 생성되는 정보 수집(Ex. IP주소)<br>
                      2. 개인정보의 이용목적과 제공정보<br>
                      가. 이용 목적<br>
                      - 고객의 회원가입, ID/PW찾기, 거래동의 등을 위한 휴대폰 본인확인 결과<br>
                      - 휴대폰 소지 확인을 위한 SMS 인증번호 전송<br>
                      - 부정 이용 방지 및 수사의뢰<br>
                      - 휴대폰번호보호서비스 해제(서비스 가입자에 한함)<br>
                      - 기타 법률에서 정한 목적<br>
                      나. 제공하는 개인정보<br>
                      - 성명, 성별, 생년월일, 내/외국인, 휴대폰번호, 이동통신사, IP주소, CI, DI [제공사 : 서비스회원사(업체별 선택 및 이용방식에 따라 전부 또는 일부를 제공)]<br>
                      - 성명, 성별, 생년월일, 휴대폰번호, 이동통신사 [제공사 : SKT, KT, LGU+]<br>
                      - 휴대폰번호 [제공사 : SKT, KT, LGU+]<br>
                      3. 개인정보의 보유 및 이용기간<br>
                      이용자의 개인정보는 원칙적으로 개인정보의 수집 및 이용목적이 달성되면 지체없이 파기합니다. 단, 다음의 정보에 대해서는 아래의 이유로 명기한 기간 동안 보유합니다.<br>
                      가. 회사 내부 방침에 의한 정보보유 사유 - 본인확인 발생 및 차단기록, 휴대폰번호<br>
                      보유 이유: 부정 이용 방지 및 민원 처리<br>
                      보유 기간: 1년<br>
                      나. 관계법령에 의한 정보보유 사유<br>
                      - 이용자 불만 또는 분쟁 처리에 관한 기록<br>
                      보유 이유: 전자상거래 등에서의 소비자보호에 관한 법률<br>
                      보유 기간: 3년
                    </v-card-text>
                  </v-card>
                </v-window-item>
                <v-window-item value="tab04_1_2">
                  <v-card 
                    flat
                    rounded="0"
                  >
                    <v-card-text>
                      [(주)케이티 귀중]<br>
                      (주)케이티(이하 ‘회사’라 함)가 제공하는 본인확인서비스를 이용하기 위해, 다음과 같이 ‘회사’가 본인의 개인정보를 수집 및 이용하고, 개인정보의 취급을 위탁하는 것에 동의합니다.<br><br>
                      1.수집항목<br>
                      - 이용자가 가입한 이동통신사, 휴대폰번호, 성명, 성별, 생년월일, 내/외국인 구분<br>
                      - 연계정보(CI), 중복가입확인정보(DI)<br>
                      - 이용자가 본인확인을 요청한 서비스명 및 URL정보, 본인확인 이용일시, IP 주소<br>
                      2.이용목적<br>
                      - 인터넷사업자의 서비스(회원가입, ID/PW찾기 등) 이용에 필요한 이용자 본인확인 여부 및 정보 전달<br>
                      (※ 이용자가 본인확인을 요청한 인터넷사업자에 한합니다.)<br>
                      - (주)케이티 등 이동통신사에 이용자 정보를 전송하여 본인확인 및 휴대폰 정보의 일치 여부 확인<br>
                      - 휴대폰 사용자 확인을 위한 SMS 인증번호 전송<br>
                      - 부정 이용 방지 및 수사의뢰<br>
                      - 이용자 본인 요청에 의한 본인확인 이력정보 제공<br>
                      - 휴대폰번호보호서비스 가입여부 확인(서비스 가입자에 한함)<br>
                      3.개인정보의 보유 및 이용기간<br>
                      "회사"는 이용자의 개인정보를 이용목적이 달성되거나 보유 및 보존기간이 종료하면 해당 정보를 지체없이 파기 하며 별도의 보관을 하지 않습니다. 단, 관련 법령 및 회사방침에 따라 보존하는 목적과 기간은 아래와 같습니다.<br>
                      - 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년(전자상거래등에서의 소비자보호에 관한 법률)<br>
                      4.본인확인서비스 제공을 위한 개인정보의 취급 위탁<br>
                      - 수탁자 : NICE평가정보<br>
                      - 취급위탁 업무 : 본인확인정보의 정확성 여부 확인, 연계정보(CI) 및 중복가입확인정보(DI) 전송, 서비스 관련 상담 및 불만 처리 등<br>
                      5. 상기 개인정보 수집 및 이용과 취급위탁에 동의하지 않는 경우, 서비스를 이용할 수 없습니다.<br>
                      ‘회사’가 제공하는 서비스의 개인정보 취급과 관련된 사항은 아래의 ‘회사’ 홈페이지에 기재된 개인정보처리방침에 따릅니다.<br>
                      - (주)케이티 : www.kt.com<br>
                      본인은 상기 내용을 숙지하였으며 이에 동의합니다.<br><br>
                      [NICE평가정보(주) 귀중]<br>
                      NICE평가정보(주)(이하 ‘회사’)는 (주)케이티의 업무를 대행하여 휴대폰본인확인서비스를 제공함에 있어 고객으로부터 개인정보를 수집하고 이용하기 위해 ‘정보통신망 이용촉진 및 정보보호에 관한 법률’에 따라서 다음과 같이 본인의 동의를 받습니다.<br><br>
                      1. 개인정보의 내용<br>
                      가. 정보항목<br>
                      - 주민등록번호, 생년월일, 성명, 성별, 내/외국인 구분, 휴대폰번호, 가입한 이동통신사, IP주소<br>
                      나. 수집방법<br>
                      - 본인인증 요청시 회원사 서비스 페이지 또는 본인인증 팝업창 페이지에서 이용자가 직접 입력<br>
                      - 본인인증 과정에서 시스템에서 생성되는 정보 수집(Ex. IP주소)<br>
                      2. 개인정보의 이용목적과 제공정보<br>
                      가. 이용 목적<br>
                      - 고객의 회원가입, ID/PW찾기, 거래동의 등을 위한 휴대폰 본인확인 결과<br>
                      - 휴대폰 소지 확인을 위한 SMS 인증번호 전송<br>
                      - 부정 이용 방지 및 수사의뢰<br>
                      - 휴대폰번호보호서비스 해제(서비스 가입자에 한함)<br>
                      - 기타 법률에서 정한 목적<br>
                      나. 제공하는 개인정보<br>
                      - 성명, 성별, 생년월일, 내/외국인, 휴대폰번호, 이동통신사, IP주소, CI, DI [제공사 : 서비스회원사(업체별 선택 및 이용방식에 따라 전부 또는 일부를 제공)]<br>
                      - 성명, 성별, 생년월일, 휴대폰번호, 이동통신사 [제공사 : SKT, KT, LGU+]<br>
                      - 휴대폰번호 [제공사 : SKT, KT, LGU+]<br>
                      3. 개인정보의 보유 및 이용기간<br>
                      이용자의 개인정보는 원칙적으로 개인정보의 수집 및 이용목적이 달성되면 지체없이 파기합니다. 단, 다음의 정보에 대해서는 아래의 이유로 명기한 기간 동안 보유합니다.<br>
                      가. 회사 내부 방침에 의한 정보보유 사유 - 본인확인 발생 및 차단기록, 휴대폰번호<br>
                      보유 이유: 부정 이용 방지 및 민원 처리<br>
                      보유 기간: 1년<br>
                      나. 관계법령에 의한 정보보유 사유<br>
                      - 이용자 불만 또는 분쟁 처리에 관한 기록<br>
                      보유 이유: 전자상거래 등에서의 소비자보호에 관한 법률<br>
                      보유 기간: 3년
                    </v-card-text>
                  </v-card>
                </v-window-item>
                <v-window-item value="tab04_1_3">
                  <v-card 
                    flat
                    rounded="0"
                  >
                    <v-card-text>
                      [LG유플러스(주) 귀중]<br>
                      LG유플러스(주) (이하 ‘회사’라 함)가 제공하는 본인확인서비스를 이용하기 위해, 다음과 같이 ‘회사’가 본인의 개인정보를 수집 및 이용하고, 개인정보의 취급을 위탁하는 것에 동의합니다.<br><br>
                      1.수집항목<br>
                      - 고객의 생년월일, 이동전화번호, 성명, 성별, 내/외국인 구분<br>
                      - 연계정보(CI), 중복가입확인정보(DI)<br>
                      - 고객이 이용하는 웹사이트 등<br>
                      2.이용목적<br>
                      - 고객이 웹사이트 또는 Application 등에 입력한 본인확인정보의 정확성 여부 확인<br>
                      - 해당 웹사이트 또는 Application 등에 연계정보(CI)와 중복가입확인정보)DI) 전송<br>
                      - 서비스 관련 상담 및 불만 처리<br>
                      - 기타 법룰에서 정한 목적<br>
                      3.개인정보의 보유 및 이용기간<br>
                      - 고객이 서비스를 이용하는 기간에 한하여 보유 및 이용을 원칙으로 하되, 법률에서 정하는 경우 해당 기간까지 보유 및 이용(세부사항은 ‘회사’의 개인정보처리방침에 따름)<br>
                      4.본인확인서비스 제공을 위한 개인정보의 취급 위탁<br>
                      수탁자, 위탁업무내용 으로 구성된 표입니다.<br>
                      수탁자	위탁업무내용<br>
                      NICE평가정보(주)	본인확인 서비스 중계 업무 제공<br>
                      CS리더, LB휴넷, 아이알링크 주식회사, (주)씨에스원파트너	고객센터 운영<br>
                      미디어로그	PASS 어플리케이션 및 웹사이트 운영/관리<br>
                      아톤	PASS 서비스 장애 및 VOC 처리<br>
                      5. 상기 개인정보 수집 및 이용과 취급위탁에 동의하지 않는 경우, 서비스를 이용할 수 없습니다.<br>
                      ‘회사’가 제공하는 서비스의 개인정보 취급과 관련된 사항은 아래의 ‘회사’ 홈페이지에 기재된 개인정보처리방침에 따릅니다.<br>
                      - LG유플러스(주) : www.lguplus.co.kr<br>
                      본인은 상기 내용을 숙지하였으며 이에 동의합니다.<br><br>
                      [NICE평가정보(주) 귀중]<br>
                      NICE평가정보(주)(이하 ‘회사’)는 (주)케이티의 업무를 대행하여 휴대폰본인확인서비스를 제공함에 있어 고객으로부터 개인정보를 수집하고 이용하기 위해 ‘정보통신망 이용촉진 및 정보보호에 관한 법률’에 따라서 다음과 같이 본인의 동의를 받습니다.<br><br>
                      1. 개인정보의 내용<br>
                      가. 정보항목<br>
                      - 주민등록번호, 생년월일, 성명, 성별, 내/외국인 구분, 휴대폰번호, 가입한 이동통신사, IP주소<br>
                      나. 수집방법<br>
                      - 본인인증 요청시 회원사 서비스 페이지 또는 본인인증 팝업창 페이지에서 이용자가 직접 입력<br>
                      - 본인인증 과정에서 시스템에서 생성되는 정보 수집(Ex. IP주소)<br>
                      2. 개인정보의 이용목적과 제공정보<br>
                      가. 이용 목적<br>
                      - 고객의 회원가입, ID/PW찾기, 거래동의 등을 위한 휴대폰 본인확인 결과<br>
                      - 휴대폰 소지 확인을 위한 SMS 인증번호 전송<br>
                      - 부정 이용 방지 및 수사의뢰<br>
                      - 휴대폰번호보호서비스 해제(서비스 가입자에 한함)<br>
                      - 기타 법률에서 정한 목적<br>
                      나. 제공하는 개인정보<br>
                      - 성명, 성별, 생년월일, 내/외국인, 휴대폰번호, 이동통신사, IP주소, CI, DI [제공사 : 서비스회원사(업체별 선택 및 이용방식에 따라 전부 또는 일부를 제공)]<br>
                      - 성명, 성별, 생년월일, 휴대폰번호, 이동통신사 [제공사 : SKT, KT, LGU+]<br>
                      - 휴대폰번호 [제공사 : SKT, KT, LGU+]<br>
                      3. 개인정보의 보유 및 이용기간<br>
                      이용자의 개인정보는 원칙적으로 개인정보의 수집 및 이용목적이 달성되면 지체없이 파기합니다. 단, 다음의 정보에 대해서는 아래의 이유로 명기한 기간 동안 보유합니다.<br>
                      가. 회사 내부 방침에 의한 정보보유 사유 - 본인확인 발생 및 차단기록, 휴대폰번호<br>
                      보유 이유: 부정 이용 방지 및 민원 처리<br>
                      보유 기간: 1년<br>
                      나. 관계법령에 의한 정보보유 사유<br>
                      - 이용자 불만 또는 분쟁 처리에 관한 기록<br>
                      보유 이유: 전자상거래 등에서의 소비자보호에 관한 법률<br>
                      보유 기간: 3년
                    </v-card-text>
                  </v-card>
                </v-window-item>
              </v-window>
            </v-window-item>
            <v-window-item value="tab04_2">
            <v-tabs
                v-model="tab04_2"
                bg-color="transparent"
                color="selected"
                class="tab-list"
              >
                <v-tab value="tab04_2_1">SKT</v-tab>
                <v-tab value="tab04_2_2">KT</v-tab>
                <v-tab value="tab04_2_3">LGU+</v-tab>
              </v-tabs>
              <v-window v-model="tab04_2">
                <v-window-item value="tab04_2_1">
                  <v-card 
                    flat
                    rounded="0"
                  >
                    <v-card-text>
                      [SK텔레콤 귀중]<br>
                      본인은 SK텔레콤(주)(이하 ‘회사’라 합니다)가 제공하는 본인확인서비스(이하 ‘서비스’라 합니다)를 이용하기 위해, 다음과 같이 ‘회사’가 본인의 개인정보를 수집/이용하고, 개인정보의 취급을 위탁하는 것에 동의합니다.<br><br>
                      1. 수집항목<br>
                      - 이용자의 성명,이동전화번호, 가입한 이동전화 회사, 생년월일, 성별<br>
                      - 연계정보(CI), 중복가입확인정보(DI)<br>
                      - 이용자가 이용하는 웹사이트 또는 Application 정보, 이용일시<br>
                      - 내외국인 여부<br>
                      - 가입한 이동전화회사 및 이동전화브랜드<br>
                      2. 이용목적<br>
                      - 이용자가 웹사이트 또는 Application에 입력한 본인확인정보의 정확성 여부 확인<br>
                      (본인확인서비스 제공)<br>
                      - 해당 웹사이트 또는 Application에 연계정보(CI)/중복가입확인정보(DI) 전송<br>
                      - 서비스 관련 상담 및 불만 처리 등<br>
                      - 이용 웹사이트/Application 정보 등에 대한 분석 및 세분화를 통한, 이용자의 서비스 이용 선호도 분석<br>
                      3. 개인정보의 보유기간 및 이용기간<br>
                      - 이용자가 서비스를 이용하는 기간에 한하여 보유 및 이용. 다만, 아래의 경우는 제외<br>
                      - 법령에서 정하는 경우 해당 기간까지 보유(상세 사항은 회사의 개인정보취급방침에 기재된 바에 따름)<br>
                      4. 본인확인서비스 제공을 위한 개인정보의 취급위탁<br>
                      수탁자, 위탁업무내용 으로 구성된 표입니다.<br>
                      수탁자	NICE평가정보(주),(주)다날,(주)드림시큐리티,SCI평가정보(주),NHN한국사이버결제(주),(주)KG모빌리언스,코리아크레딧뷰로(주),한국모바일인증(주)<br>
                      위탁업무내용	본인확인정보의 정확성 여부 확인(본인확인서비스 제공), 연계정보(CI)/중복가입확인정보(DI) 생성 및 전송, 서비스 관련 상담 및 불만 처리, 휴대폰인증보호 서비스, 이용자의 서비스 이용 선호도 분석정보 제공관련 시스템 구축 광고매체 연동 및 위탁영업 등<br>
                      ※수탁자의 상세 개인정보 취급 위탁 내용은 각 수탁자가 정하는 절차와 방법에 따라 수탁자 홈페이지 등에 게시된 수탁자의 개인정보 취급방침 및 제3자 제공 동의 방침 등에 따릅니다.<br>
                      5. 위 개인정보 수집·이용 및 취급위탁에 동의하지 않으실 경우, 서비스를 이용하실 수 없습니다.<br>
                      * 회사가 제공하는 서비스와 관련된 개인정보의 취급과 관련된 사항은, 회사의 개인정보취급방침(회사 홈페이지 www.sktelecom.com )에 따릅니다.<br>
                      본인은 위 내용을 숙지하였으며 이에 동의합니다.<br><br>
                      <코리아크레딧뷰로㈜ 귀중><br>
                      귀사가 통신사(에스케이텔레콤㈜, ㈜케이티, LG유플러스㈜)로부터 위탁 받아 제공하는 휴대폰본인확인서비스 이용과 관련하여 본인의 개인정보를 수집·이용 및 제공하고자 하는 경우에는 「개인정보보호법」 제15조, 제22조, 제24조, 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」 제22조에 따라 본인의 동의를 얻어야 합니다. 이에 본인은 귀사가 아래와 같이 본인의 개인정보를 수집 · 이용 및 제공 하는데 동의합니다.<br><br>
                      □ 개인정보의 수집 및 이용목적<br>
                      ① 주민등록번호 대체서비스 제공<br>
                      개인정보보호법 제24조 2항에 의해 온라인 또는 오프라인상에서 회원가입, 글쓰기, 포인트적립 등 주민등록번호를 사용하지 않고도 본인임을 확인할 수 있는 개인정보보호 서비스(휴대폰본인확인서비스) 제공<br>
                      ② 에스케이텔레콤(주), (주)케이티, LG유플러스(주) 등 통신사에 이용자 정보를 전송하여 본인확인 및 휴대폰 정보의 일치 여부 확인<br>
                      ③ 휴대폰 사용자 확인을 위한 SMS(또는 LMS) 인증번호 전송<br>
                      ④ 부정 이용 방지 및 수사의뢰<br>
                      ⑤ 이용자 본인 요청에 의한 본인확인 이력정보 제공, 민원처리, 추후 분쟁조정을 위한 기록보존, 고지사항 전달 등<br>
                      ⑥ 휴대폰번호보호서비스 가입여부 확인(서비스 가입자에 한함)<br><br>
                      □ 수집할 개인정보<br>
                      ① 이용자가 가입한 이동통신사, 휴대폰번호, 성명, 성별, 생년월일, 내/외국인 구분<br>
                      ② 중복가입확인정보(발급자의 웹사이트 중복가입 여부를 확인할 수 있는 정보)<br>
                      ③ 연계정보(온/오프라인 사업자간 제휴 등 연계서비스가 가능하도록 특정 개인을 식별할 수 있는 정보)<br>
                      ④ 인증처 및 사이트 URL<br>
                      ⑤ 인증일시<br>
                      ⑥ IP주소<br><br>
                      □ 개인정보의 제공<br>
                      ① 휴대폰본인확인서비스 제공<br>
                      - 제공 받는자: SK텔레콤(주), (주)케이티, ㈜엘지유플러스<br>
                      - 제공 목적: 업무대행(본인확인정보 및 연계정보 전송 및 서비스 관련 업무 상담 및 불만처리 등)<br>
                      - 제공 항목: 생년월일, 성명, 성별, 내/외국인 구분, 휴대폰번호, 이동통신사<br>
                      - 보유 기간: “제공받는 자”의 이용목적 달성 시 까지 보관하며, 세부사항은 각 사업자의 개인정보처리방침을 따름<br>
                      ② 휴대폰본인확인서비스 문자발송<br>
                      - 제공 받는자: SK텔레콤(주), (주)케이티, ㈜엘지유플러스<br>
                      - 제공 목적: 휴대폰본인확인서비스 점유확인을 위한 문자발송<br>
                      - 제공 항목: 휴대폰번호<br>
                      - 보유 기간: “제공받는 자”의 이용목적 달성 시 까지 보관하며, 세부사항은 각 사업자의 개인정보처리방침을 따름<br>
                      ③ 휴대폰본인확인서비스 제공 (서비스 이용 사업자)<br>
                      - 제공 받는자: 휴대폰본인확인서비스 이용 회사(코리아크레딧뷰로㈜(이하 “회사”)와 계약된 사업자)<br>
                      - 제공 목적: 휴대폰본인확인서비스 제공<br>
                      - 제공 항목: 생년월일, 성명, 성별, 내/외국인 구분, 휴대폰번호, 이동통신사, IP주소, 중복가입확인정보(DI), 연계정보(CI)<br>
                      - 보유 기간: “회사”와 계약한 사업자의 이용목적 달성시 까지 보관하며, 세부사항은 각 사업자의 개인정보처리방침을 따름<br>
                      ④ 휴대폰인증보호서비스 안내(광고성정보 수신동의 선택 시)<br>
                      - 제공 받는자: ㈜민앤지, ㈜한국인증플랫폼즈<br>
                      - 제공 목적: 휴대폰인증보호서비스(휴대폰번호도용방지서비스) 안내<br>
                      - 제공 항목: 휴대폰번호, 통신<br>
                      - 보유 기간: 목적달성 후 폐기(동의 철회 시)<br><br>
                      □ 개인정보의 보유 및 이용기간<br>
                      개인정보는 원칙적으로 개인정보의 수집목적 또는 제공받은 목적이 소멸되면 파기됩니다. 단, “개인정보보호법”, “정보통신망 이용 촉진 및 정보보호 등에 관한 법률”, “신용정보의 이용 및 보호에 관한 법률”, ” 본인확인기관 지정 및 관리에 관한 지침”, ”방송통신위원회 고시” 등 기타 관련법령의 규정에 의하여 법률관계의 확인 등을 이유로 특정한 기간 동안 보유하여야 할 필요가 있을 경우에는 아래에 정한 기간 동안 보유합니다.<br>
                      ① 방송통신위원회 정기점검 이행조치 및 회사내부 방침에 의한 정보보유 사유로 본인확인 이력보관<br>
                      - 부정이용 방지 및 민원처리 : 1년 이내<br>
                      ② 관계법령에 의한 정보보호 사유<br>
                      - 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년<br><br>
                      □ 동의거부권리 및 거부에 따른 불이익 내용<br>
                      개인정보 수집·이용 및 제공 에 따른 동의는 거부할 수 있으며, 동의 후에도 언제든지 철회 가능합니다. 다만, 동의 거부 시에는 서비스 이용이 제한될 수 있습니다.
                    </v-card-text>
                  </v-card>
                </v-window-item>
                <v-window-item value="tab04_2_2">
                  <v-card 
                    flat
                    rounded="0"
                  >
                    <v-card-text>
                      [(주)케이티 귀중]<br>
                      (주)케이티(이하 ‘회사’라 함)가 제공하는 본인확인서비스를 이용하기 위해, 다음과 같이 ‘회사’가 본인의 개인정보를 수집 및 이용하고, 개인정보의 취급을 위탁하는 것에 동의합니다.<br><br>
                      1.수집항목<br>
                      - 이용자가 가입한 이동통신사, 휴대폰번호, 성명, 성별, 생년월일, 내/외국인 구분<br>
                      - 연계정보(CI), 중복가입확인정보(DI)<br>
                      - 이용자가 본인확인을 요청한 서비스명 및 URL정보, 본인확인 이용일시, IP 주소<br>
                      2.이용목적<br>
                      - 인터넷사업자의 서비스(회원가입, ID/PW찾기 등) 이용에 필요한 이용자 본인확인 여부 및 정보 전달<br>
                      (※ 이용자가 본인확인을 요청한 인터넷사업자에 한합니다.)<br>
                      - (주)케이티 등 이동통신사에 이용자 정보를 전송하여 본인확인 및 휴대폰 정보의 일치 여부 확인<br>
                      - 휴대폰 사용자 확인을 위한 SMS 인증번호 전송<br>
                      - 부정 이용 방지<br>
                      - 이용자 본인 요청에 의한 본인확인 이력정보 제공<br>
                      - 휴대폰번호보호서비스 가입여부 확인(서비스 가입자에 한함)<br>
                      - 기타 법률에서 정한 목적<br>
                      3.개인정보의 보유 및 이용기간<br>
                      "회사"는 이용자의 개인정보를 이용목적이 달성되거나 보유 및 보존기간이 종료하면 해당 정보를 지체없이 파기 하며 별도의 보관을 하지 않습니다. 단, 아래의 경우는 제외합니다.<br>
                      - 법령에서 정하는 경우 해당 기간까지 보유(상세 사항은 회사의 개인정보처리방침에 기재된 바에 따름<br>
                      4.본인확인서비스 제공을 위한 개인정보의 취급 위탁<br>
                      - 수탁자 : 코리아크레딧뷰로(주)<br>
                      - 취급위탁 업무 : 본인확인정보의 정확성 여부 확인, 연계정보(CI) 및 중복가입확인정보(DI) 전송, 서비스 관련 상담 및 불만 처리 등<br>
                      5. 상기 개인정보 수집 및 이용과 취급위탁에 동의하지 않는 경우, 서비스를 이용할 수 없습니다.<br>
                      ‘회사’가 제공하는 서비스의 개인정보 취급과 관련된 사항은 아래의 ‘회사’ 홈페이지에 기재된 개인정보취급방침에 따릅니다.<br>
                      - (주)케이티 : www.kt.com<br>
                      본인은 상기 내용을 숙지하였으며 이에 동의합니다.<br><br>
                      <코리아크레딧뷰로㈜ 귀중><br>
                      귀사가 통신사(에스케이텔레콤㈜, ㈜케이티, LG유플러스㈜)로부터 위탁 받아 제공하는 휴대폰본인확인서비스 이용과 관련하여 본인의 개인정보를 수집·이용 및 제공하고자 하는 경우에는 「개인정보보호법」 제15조, 제22조, 제24조, 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」 제22조에 따라 본인의 동의를 얻어야 합니다. 이에 본인은 귀사가 아래와 같이 본인의 개인정보를 수집 · 이용 및 제공 하는데 동의합니다.<br><br>
                      □ 개인정보의 수집 및 이용목적<br>
                      ① 주민등록번호 대체서비스 제공<br>
                      개인정보보호법 제24조 2항에 의해 온라인 또는 오프라인상에서 회원가입, 글쓰기, 포인트적립 등 주민등록번호를 사용하지 않고도 본인임을 확인할 수 있는 개인정보보호 서비스(휴대폰본인확인서비스) 제공<br>
                      ② 에스케이텔레콤(주), (주)케이티, LG유플러스(주) 등 통신사에 이용자 정보를 전송하여 본인확인 및 휴대폰 정보의 일치 여부 확인<br>
                      ③ 휴대폰 사용자 확인을 위한 SMS(또는 LMS) 인증번호 전송<br>
                      ④ 부정 이용 방지 및 수사의뢰<br>
                      ⑤ 이용자 본인 요청에 의한 본인확인 이력정보 제공, 민원처리, 추후 분쟁조정을 위한 기록보존, 고지사항 전달 등<br>
                      ⑥ 휴대폰번호보호서비스 가입여부 확인(서비스 가입자에 한함)<br><br>
                      □ 수집할 개인정보<br>
                      ① 이용자가 가입한 이동통신사, 휴대폰번호, 성명, 성별, 생년월일, 내/외국인 구분<br>
                      ② 중복가입확인정보(발급자의 웹사이트 중복가입 여부를 확인할 수 있는 정보)<br>
                      ③ 연계정보(온/오프라인 사업자간 제휴 등 연계서비스가 가능하도록 특정 개인을 식별할 수 있는 정보)<br>
                      ④ 인증처 및 사이트 URL<br>
                      ⑤ 인증일시<br>
                      ⑥ IP주소<br><br>
                      □ 개인정보의 제공<br>
                      ① 휴대폰본인확인서비스 제공<br>
                      - 제공 받는자: SK텔레콤(주), (주)케이티, ㈜엘지유플러스<br>
                      - 제공 목적: 업무대행(본인확인정보 및 연계정보 전송 및 서비스 관련 업무 상담 및 불만처리 등)<br>
                      - 제공 항목: 생년월일, 성명, 성별, 내/외국인 구분, 휴대폰번호, 이동통신사<br>
                      - 보유 기간: “제공받는 자”의 이용목적 달성 시 까지 보관하며, 세부사항은 각 사업자의 개인정보처리방침을 따름<br>
                      ② 휴대폰본인확인서비스 문자발송<br>
                      - 제공 받는자: SK텔레콤(주), (주)케이티, ㈜엘지유플러스<br>
                      - 제공 목적: 휴대폰본인확인서비스 점유확인을 위한 문자발송<br>
                      - 제공 항목: 휴대폰번호<br>
                      - 보유 기간: “제공받는 자”의 이용목적 달성 시 까지 보관하며, 세부사항은 각 사업자의 개인정보처리방침을 따름<br>
                      ③ 휴대폰본인확인서비스 제공 (서비스 이용 사업자)<br>
                      - 제공 받는자: 휴대폰본인확인서비스 이용 회사(코리아크레딧뷰로㈜(이하 “회사”)와 계약된 사업자)<br>
                      - 제공 목적: 휴대폰본인확인서비스 제공<br>
                      - 제공 항목: 생년월일, 성명, 성별, 내/외국인 구분, 휴대폰번호, 이동통신사, IP주소, 중복가입확인정보(DI), 연계정보(CI)<br>
                      - 보유 기간: “회사”와 계약한 사업자의 이용목적 달성시 까지 보관하며, 세부사항은 각 사업자의 개인정보처리방침을 따름<br>
                      ④ 휴대폰인증보호서비스 안내(광고성정보 수신동의 선택 시)<br>
                      - 제공 받는자: ㈜민앤지, ㈜한국인증플랫폼즈<br>
                      - 제공 목적: 휴대폰인증보호서비스(휴대폰번호도용방지서비스) 안내<br>
                      - 제공 항목: 휴대폰번호, 통신<br>
                      - 보유 기간: 목적달성 후 폐기(동의 철회 시)<br><br>
                      □ 개인정보의 보유 및 이용기간<br>
                      개인정보는 원칙적으로 개인정보의 수집목적 또는 제공받은 목적이 소멸되면 파기됩니다. 단, “개인정보보호법”, “정보통신망 이용 촉진 및 정보보호 등에 관한 법률”, “신용정보의 이용 및 보호에 관한 법률”, ” 본인확인기관 지정 및 관리에 관한 지침”, ”방송통신위원회 고시” 등 기타 관련법령의 규정에 의하여 법률관계의 확인 등을 이유로 특정한 기간 동안 보유하여야 할 필요가 있을 경우에는 아래에 정한 기간 동안 보유합니다.<br>
                      ① 방송통신위원회 정기점검 이행조치 및 회사내부 방침에 의한 정보보유 사유로 본인확인 이력보관<br>
                      - 부정이용 방지 및 민원처리 : 1년 이내<br>
                      ② 관계법령에 의한 정보보호 사유<br>
                      - 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년<br><br>
                      □ 동의거부권리 및 거부에 따른 불이익 내용<br>
                      개인정보 수집·이용 및 제공 에 따른 동의는 거부할 수 있으며, 동의 후에도 언제든지 철회 가능합니다. 다만, 동의 거부 시에는 서비스 이용이 제한될 수 있습니다.
                    </v-card-text>
                  </v-card>
                </v-window-item>
                <v-window-item value="tab04_2_3">
                  <v-card 
                    flat
                    rounded="0"
                  >
                    <v-card-text>
                      [LGU플러스(주) 귀중]<br>
                      LGU플러스(주) (이하 ‘회사’라 함)가 제공하는 본인확인서비스를 이용하기 위해, 다음과 같이 ‘회사’가 본인의 개인정보를 수집 및 이용하고, 개인정보의 취급을 위탁하는 것에 동의합니다.<br><br>
                      1.수집항목<br>
                      - 고객의 생년월일, 이동전화번호, 성명, 성별, 내/외국인 구분<br>
                      - 연계정보(CI), 중복가입확인정보(DI)<br>
                      - 고객이 이용하는 웹사이트 등<br>
                      2.이용목적<br>
                      - 고객이 웹사이트 또는 Application 등에 입력한 본인확인정보의 정확성 여부 확인<br>
                      - 해당 웹사이트 또는 Application 등에 연계정보(CI)와 중복가입확인정보)DI) 전송<br>
                      - 서비스 관련 상담 및 불만 처리<br>
                      - 기타 법룰에서 정한 목적<br>
                      3.개인정보의 보유 및 이용기간<br>
                      - 고객이 서비스를 이용하는 기간에 한하여 보유 및 이용을 원칙으로 하되, 법률에서 정하는 경우 해당 기간까지 보유 및 이용(세부사항은 ‘회사’의 개인정보취급방침에 따름)<br>
                      4.본인확인서비스 제공을 위한 개인정보의 취급 위탁<br>
                      - 수탁자 : 코리아크레딧뷰로㈜<br>
                      - 위탁업무내용: 본인확인 서비스 중계 업무 제공<br>
                      - 수탁자 : CS리더, LB휴넷, 아이알링크 주식회사, (주)씨에스원파트너<br>
                      - 위탁업무내용: 고객센터 운영<br>
                      - 수탁자 : 미디어로그<br>
                      - 위탁업무내용: PASS 어플리케이션 및 웹사이트 운영/관리<br>
                      - 수탁자 : 아톤<br>
                      - 위탁업무내용: PASS 서비스 장애 및 VOC처리<br>
                      5. 상기 개인정보 수집 및 이용과 취급위탁에 동의하지 않는 경우, 서비스를 이용할 수 없습니다.<br>
                      ‘회사’가 제공하는 서비스의 개인정보 취급과 관련된 사항은 아래의 ‘회사’ 홈페이지에 기재된 개인정보취급방침에 따릅니다.<br>
                      - LGU플러스(주) : www.lguplus.co.kr<br>
                      본인은 상기 내용을 숙지하였으며 이에 동의합니다.<br><br>
                      <코리아크레딧뷰로㈜ 귀중><br>
                      귀사가 통신사(에스케이텔레콤㈜, ㈜케이티, LG유플러스㈜)로부터 위탁 받아 제공하는 휴대폰본인확인서비스 이용과 관련하여 본인의 개인정보를 수집·이용 및 제공하고자 하는 경우에는 「개인정보보호법」 제15조, 제22조, 제24조, 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」 제22조에 따라 본인의 동의를 얻어야 합니다. 이에 본인은 귀사가 아래와 같이 본인의 개인정보를 수집 · 이용 및 제공 하는데 동의합니다.<br><br>
                      □ 개인정보의 수집 및 이용목적<br>
                      ① 주민등록번호 대체서비스 제공
                      개인정보보호법 제24조 2항에 의해 온라인 또는 오프라인상에서 회원가입, 글쓰기, 포인트적립 등 주민등록번호를 사용하지 않고도 본인임을 확인할 수 있는 개인정보보호 서비스(휴대폰본인확인서비스) 제공<br>
                      ② 에스케이텔레콤(주), (주)케이티, LG유플러스(주) 등 통신사에 이용자 정보를 전송하여 본인확인 및 휴대폰 정보의 일치 여부 확인<br>
                      ③ 휴대폰 사용자 확인을 위한 SMS(또는 LMS) 인증번호 전송<br>
                      ④ 부정 이용 방지 및 수사의뢰<br>
                      ⑤ 이용자 본인 요청에 의한 본인확인 이력정보 제공, 민원처리, 추후 분쟁조정을 위한 기록보존, 고지사항 전달 등<br>
                      ⑥ 휴대폰번호보호서비스 가입여부 확인(서비스 가입자에 한함)<br><br>
                      □ 수집할 개인정보<br>
                      ① 이용자가 가입한 이동통신사, 휴대폰번호, 성명, 성별, 생년월일, 내/외국인 구분<br>
                      ② 중복가입확인정보(발급자의 웹사이트 중복가입 여부를 확인할 수 있는 정보)<br>
                      ③ 연계정보(온/오프라인 사업자간 제휴 등 연계서비스가 가능하도록 특정 개인을 식별할 수 있는 정보)<br>
                      ④ 인증처 및 사이트 URL<br>
                      ⑤ 인증일시<br>
                      ⑥ IP주소<br><br>
                      □ 개인정보의 제공<br>
                      ① 휴대폰본인확인서비스 제공<br>
                      - 제공 받는자: SK텔레콤(주), (주)케이티, ㈜엘지유플러스<br>
                      - 제공 목적: 업무대행(본인확인정보 및 연계정보 전송 및 서비스 관련 업무 상담 및 불만처리 등)<br>
                      - 제공 항목: 생년월일, 성명, 성별, 내/외국인 구분, 휴대폰번호, 이동통신사<br>
                      - 보유 기간: “제공받는 자”의 이용목적 달성 시 까지 보관하며, 세부사항은 각 사업자의 개인정보처리방침을 따름<br>
                      ② 휴대폰본인확인서비스 문자발송<br>
                      - 제공 받는자: SK텔레콤(주), (주)케이티, ㈜엘지유플러스<br>
                      - 제공 목적: 휴대폰본인확인서비스 점유확인을 위한 문자발송<br>
                      - 제공 항목: 휴대폰번호<br>
                      - 보유 기간: “제공받는 자”의 이용목적 달성 시 까지 보관하며, 세부사항은 각 사업자의 개인정보처리방침을 따름<br>
                      ③ 휴대폰본인확인서비스 제공 (서비스 이용 사업자)<br>
                      - 제공 받는자: 휴대폰본인확인서비스 이용 회사(코리아크레딧뷰로㈜(이하 “회사”)와 계약된 사업자)<br>
                      - 제공 목적: 휴대폰본인확인서비스 제공<br>
                      - 제공 항목: 생년월일, 성명, 성별, 내/외국인 구분, 휴대폰번호, 이동통신사, IP주소, 중복가입확인정보(DI), 연계정보(CI)<br>
                      - 보유 기간: “회사”와 계약한 사업자의 이용목적 달성시 까지 보관하며, 세부사항은 각 사업자의 개인정보처리방침을 따름<br>
                      ④ 휴대폰인증보호서비스 안내(광고성정보 수신동의 선택 시)<br>
                      - 제공 받는자: ㈜민앤지, ㈜한국인증플랫폼즈<br>
                      - 제공 목적: 휴대폰인증보호서비스(휴대폰번호도용방지서비스) 안내<br>
                      - 제공 항목: 휴대폰번호, 통신<br>
                      - 보유 기간: 목적달성 후 폐기(동의 철회 시)<br><br>
                      □ 개인정보의 보유 및 이용기간<br>
                      개인정보는 원칙적으로 개인정보의 수집목적 또는 제공받은 목적이 소멸되면 파기됩니다. 단, “개인정보보호법”, “정보통신망 이용 촉진 및 정보보호 등에 관한 법률”, “신용정보의 이용 및 보호에 관한 법률”, ” 본인확인기관 지정 및 관리에 관한 지침”, ”방송통신위원회 고시” 등 기타 관련법령의 규정에 의하여 법률관계의 확인 등을 이유로 특정한 기간 동안 보유하여야 할 필요가 있을 경우에는 아래에 정한 기간 동안 보유합니다.<br>
                      ① 방송통신위원회 정기점검 이행조치 및 회사내부 방침에 의한 정보보유 사유로 본인확인 이력보관<br>
                      - 부정이용 방지 및 민원처리 : 1년 이내<br>
                      ② 관계법령에 의한 정보보호 사유<br>
                      - 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년<br><br>
                      □ 동의거부권리 및 거부에 따른 불이익 내용<br>
                      개인정보 수집·이용 및 제공 에 따른 동의는 거부할 수 있으며, 동의 후에도 언제든지 철회 가능합니다. 다만, 동의 거부 시에는 서비스 이용이 제한될 수 있습니다.
                    </v-card-text>
                  </v-card>
                </v-window-item>
              </v-window>
            </v-window-item>
          </v-window>
        </v-card>
      </div>
      <v-btn
        @click="agree = false"
        variant="text"
        class="btn-popup-close"
      >
        <span class="sr-only">닫기</span>
      </v-btn>
    </div>
    <!-- // 개인정보 수집 및 이용 동의 -->
  </v-dialog>
</template>

<style scoped>
.v-btn--size-default {
  font-size: 1.4rem;
}
</style>