<script setup>
import { ref } from 'vue';

const tab = ref(null);
const tab02_1 = ref(null);
const tab02_2 = ref(null);
const agree = ref(false);
</script>

<template>
  <v-dialog v-model="agree">
    <!-- 샘플 버튼 -->
    <template v-slot:activator="{ props: activatorProps }">
      <v-btn v-bind="activatorProps">
        고유식별정보 처리 동의 팝업
      </v-btn>
    </template>
    <!-- // 샘플 버튼 -->

    <!-- 고유식별정보 처리 동의 -->
    <div class="popup-wrap large">
      <div class="popup-head">
        <h3 class="h-title">고유식별정보 처리 동의</h3>
      </div>
      <div class="popup-cont">
        <v-card
          flat
          rounded="0"
          class="tab-cont"
        >
          <v-tabs
            v-model="tab"
            bg-color="transparent"
            color="selected"
          >
            <v-tab value="tab02_1">NICE평가정보</v-tab>
            <v-tab value="tab02_2">KCB</v-tab>
          </v-tabs>
          <v-window v-model="tab">
            <v-window-item value="tab02_1">
              <v-tabs
                v-model="tab02_1"
                bg-color="transparent"
                color="selected"
                class="tab-list"
              >
                <v-tab value="tab02_1_1">SKT</v-tab>
                <v-tab value="tab02_1_2">KT</v-tab>
                <v-tab value="tab02_1_3">LGU+</v-tab>
              </v-tabs>
              <v-window v-model="tab02_1">
                <v-window-item value="tab02_1_1">
                  <v-card 
                    flat
                    rounded="0"
                  >
                    <v-card-text>
                      [SK텔레콤 귀중]<br>
                      본인은 SK텔레콤(주)(이하 ‘회사’라 합니다)가 제공하는 본인확인서비스(이하 ‘서비스’라 합니다)를 이용하기 위해, 다음과 같이 본인의 개인정보를 회사가 아래 기재된 제3자에게 제공하는 것에 동의합니다.<br><br>
                      1. 개인정보를 제공받는 자<br>
                      - NICE평가정보(주), SCI평가정보(주)<br>
                      2. 개인정보를 제공받는 자의 개인정보 이용목적<br>
                      - 연계정보(CI)/중복가입확인정보(DI) 생성 및 회사에 제공<br>
                      - 부정 이용 방지 및 민원 처리<br>
                      3. 제공하는 개인정보 항목<br>
                      - 회사가 보유하고 있는 이용자의 주민등록번호<br>
                      4. 개인정보를 제공받는 자의 개인정보 보유 및 이용기간<br>
                      - 연계정보(CI)/중복가입확인정보(DI) 생성 후 3개월<br>
                      5. 위 개인정보 제공에 동의하지 않으실 경우, 서비스를 이용할 수 없습니다.<br><br>
                      NICE평가정보 귀중<br>
                      NICE평가정보(주) (이하 “회사”)가 에스케이텔레콤(주), (주)케이티, LG유플러스(주)의 업무 대행을 통해 제공하는 휴대폰본인확인서비스와 관련하여 고객으로부터 수집한 고유식별정보를 이용 및 처리하거나 제3자에게 제공하고자 할 때에는 ‘정보통신망 이용촉진 및 정보보호 등에 관한 법률’에 따라서 고객으로 부터 동의를 받아야 합니다.<br><br>
                      제1조 [고유식별정보의 이용 및 처리 목적]<br>
                      “회사”는 고객의 고유식별정보를 아래의 목적으로 이용 및 처리할 수 있습니다.<br>
                      1. 본인확인서비스 제공<br>
                      2. 부정 이용 방지 및 수사의뢰<br>
                      3. 휴대폰번호보호서비스 해제 (서비스 가입자에 한함)<br><br>
                      제 2조 [고유식별정보의 이용 및 처리 내용]<br>
                      에스케이텔레콤(주), (주)케이티, LG유플러스(주)의 통신사 또는 통신사의 대행업무를 수행하는 사업자에 정보를 전송하여 방송통신위원회에서 고시로 지정한 휴대폰본인확인기관을 통해 본인여부를 확인하고 결과를 제공받기 위해 고유식별정보가 이용 및 처리됩니다.<br>
                      - 이용 및 처리되는 고유식별정보 : 주민등록번호(내국인), 외국인등록번호(외국인)<br>
                      상기와 같이 고유식별정보 이용 및 처리에 동의합니다.
                    </v-card-text>
                  </v-card>
                </v-window-item>
                <v-window-item value="tab02_1_2">
                  <v-card 
                    flat
                    rounded="0"
                  >
                    <v-card-text>
                      [(주)케이티 귀중]<br>
                      주)케이티 (이하 "본인확인기관")가 NICE평가정보(주) (이하 "회사")을 통해 제공하는 휴대폰 본인확인 서비스 관련하여 이용자로부터 수집한 고유식별정보를 이용하거나 타인에게 제공할 때에는 '정보통신망 이용촉진 및 정보보호 등에 관한 법률'(이하 "정보통신망법")에 따라 이용자의 동의를 얻어야 합니다.<br><br>
                      ■ 제 1 조[고유식별정보의 처리 동의]<br>
                      "본인확인기관"은 정보통신망법 제23조의2 제2항에 따라 인터넷상에서 주민등록번호를 입력하지 않고도 본인임을 확인할 수 있는 휴대폰 본인확인서비스를 제공하기 위해 고유식별정보를 처리합니다.<br><br>
                      ■ 제 2 조[고유식별정보의 제공 동의]<br>
                      "본인확인기관 지정 등에 관한 기준(방송통신위원회 고시)"에 따라 "회사"와 계약한 정보통신서비스 제공자 의 연계서비스 및 중복가입확인을 위해 아래와 같이 본인의 고유식별정보를 '다른 본인확인기관'에 제공하는 것에 동의합니다.<br><br>
                      [고유식별정보 제공 동의]<br>
                      1. 제공자(본인확인기관)<br>
                      (주)케이티<br>
                      2. 제공 받는자(본인확인기관)<br>
                      코리아크레딧뷰로㈜, SCI평가정보㈜<br>
                      3. 제공하는 항목<br>
                      주민등록번호(내국인), 외국인등록번호(국내거주외국인)<br>
                      4. 제공 목적<br>
                      CI(연계정보), DI(중복가입확인정보)의 생성 및 전달<br>
                      5. 보유 및 이용기간<br>
                      CI(연계정보), DI(중복가입확인정보) 생성 즉시 폐기<br><br>
                      [NICE평가정보 귀중]<br>
                      NICE평가정보(주) (이하 “회사”)가 에스케이텔레콤(주), (주)케이티, LG유플러스(주)의 업무 대행을 통해 제공하는 휴대폰본인확인서비스와 관련하여 고객으로부터 수집한 고유식별정보를 이용 및 처리하거나 제3자에게 제공하고자 할 때에는 ‘정보통신망 이용촉진 및 정보보호 등에 관한 법률’에 따라서 고객으로 부터 동의를 받아야 합니다.<br><br>
                      제1조 [고유식별정보의 이용 및 처리 목적]<br>
                      “회사”는 고객의 고유식별정보를 아래의 목적으로 이용 및 처리할 수 있습니다.<br>
                      1. 본인확인서비스 제공<br>
                      2. 부정 이용 방지 및 수사의뢰<br>
                      3. 휴대폰번호보호서비스 해제 (서비스 가입자에 한함)<br><br>
                      제 2조 [고유식별정보의 이용 및 처리 내용]<br>
                      에스케이텔레콤(주), (주)케이티, LG유플러스(주)의 통신사 또는 통신사의 대행업무를 수행하는 사업자에 정보를 전송하여 방송통신위원회에서 고시로 지정한 휴대폰본인확인기관을 통해 본인여부를 확인하고 결과를 제공받기 위해 고유식별정보가 이용 및 처리됩니다.<br>
                      - 이용 및 처리되는 고유식별정보 : 주민등록번호(내국인), 외국인등록번호(외국인)<br>
                      상기와 같이 고유식별정보 이용 및 처리에 동의합니다.
                    </v-card-text>
                  </v-card>
                </v-window-item>
                <v-window-item value="tab02_1_3">
                  <v-card 
                    flat
                    rounded="0"
                  >
                    <v-card-text>
                      [LG유플러스(주) 귀중]<br>
                      LG유플러스(주)(이하 ‘회사’)가 휴대폰본인확인서비스(이하 ‘서비스’)를 제공하기 위해 고유식별정보를 다음과 같이 제3자에게 제공 및 처리 하는 데에 동의합니다.<br><br>
                      1.고유식별정보를 제공받는자<br>
                      - NICE평가정보㈜, SCI평가정보㈜, 코리아크레딧뷰로㈜<br>
                      2.고유식별정보를 제공받는자의 목적<br>
                      - 연계정보(CI)와 중복가입확인정보(DI)의 생성 및 ‘회사’ 제공<br>
                      - 부정 이용 방지 및 민원 처리<br>
                      3.고유식별정보 제공 항목: ‘회사’가 보유하고 있는 고객의 주민등록번호와 외국인등록번호<br>
                      4.고유식별정보를 제공받는 자의 보유 및 이용기간: 제공받는자의 개인정보처리방침에 따름<br>
                      5.상기 고유식별정보 처리에 대한 내용에 동의하지 않으실 경우, ‘서비스’를 이용할 수 없습니다.<br>
                      상기와 같이 고유식별정보 이용 및 처리에 동의합니다.<br><br>
                      [NICE평가정보 귀중]<br>
                      NICE평가정보(주) (이하 “회사”)가 에스케이텔레콤(주), (주)케이티, LG유플러스(주)의 업무 대행을 통해 제공하는 휴대폰본인확인서비스와 관련하여 고객으로부터 수집한 고유식별정보를 이용 및 처리하거나 제3자에게 제공하고자 할 때에는 ‘정보통신망 이용촉진 및 정보보호 등에 관한 법률’에 따라서 고객으로 부터 동의를 받아야 합니다.<br><br>
                      제1조 [고유식별정보의 이용 및 처리 목적]<br>
                      “회사”는 고객의 고유식별정보를 아래의 목적으로 이용 및 처리할 수 있습니다.<br>
                      1. 본인확인서비스 제공<br>
                      2. 부정 이용 방지 및 수사의뢰<br>
                      3. 휴대폰번호보호서비스 해제 (서비스 가입자에 한함)<br><br>
                      제 2조 [고유식별정보의 이용 및 처리 내용]<br>
                      에스케이텔레콤(주), (주)케이티, LG유플러스(주)의 통신사 또는 통신사의 대행업무를 수행하는 사업자에 정보를 전송하여 방송통신위원회에서 고시로 지정한 휴대폰본인확인기관을 통해 본인여부를 확인하고 결과를 제공받기 위해 고유식별정보가 이용 및 처리됩니다.<br>
                      - 이용 및 처리되는 고유식별정보 : 주민등록번호(내국인), 외국인등록번호(외국인)<br>
                      상기와 같이 고유식별정보 이용 및 처리에 동의합니다.
                    </v-card-text>
                  </v-card>
                </v-window-item>
              </v-window>
            </v-window-item>
            <v-window-item value="tab02_2">
            <v-tabs
                v-model="tab02_2"
                bg-color="transparent"
                color="selected"
                class="tab-list"
              >
                <v-tab value="tab02_2_1">SKT</v-tab>
                <v-tab value="tab02_2_2">KT</v-tab>
                <v-tab value="tab02_2_3">LGU+</v-tab>
              </v-tabs>
              <v-window v-model="tab02_2">
                <v-window-item value="tab02_2_1">
                  <v-card 
                    flat
                    rounded="0"
                  >
                    <v-card-text>
                      [SK텔레콤 귀중]<br>
                      본인은 SK텔레콤(주)(이하 ‘회사’라 합니다)가 제공하는 본인확인서비스(이하 ‘서비스’라 합니다)를 이용하기 위해, 다음과 같이 본인의 개인정보를 회사가 아래 기재된 제3자에게 제공하는 것에 동의합니다.<br><br>
                      1. 개인정보를 제공받는 자<br>
                      - NICE평가정보(주), SCI평가정보(주),<br>
                      2. 개인정보를 제공받는 자의 개인정보 이용목적<br>
                      - 부정 이용 방지 및 민원 처리<br>
                      3. 제공하는 개인정보 항목<br>
                      - 회사가 보유하고 있는 이용자의 주민등록번호 및 외국인등록번호<br>
                      4. 개인정보를 제공받는 자의 개인정보 보유 및 이용기간<br>
                      - 연계정보(CI)/중복가입확인정보(DI) 생성 후 6개월<br>
                      5. 위 개인정보 제공에 동의하지 않으실 경우, 서비스를 이용할 수 없습니다.<br><br>
                      <코리아크레딧뷰로㈜ 귀중><br>
                      귀사가 에스케이텔레콤㈜, ㈜케이티, LG유플러스㈜ 등 통신사로부터 위탁 받아 제공하는 휴대폰본인확인서비스 이용과 관련하여, 본인의 개인정보를 수집·이용하고자 하는 경우 「개인정보보호법」 제17조, 제22조, 제24조, 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」 제24조의2에 따라 제3자에게 제공할 경우 본인의 사전동의를 얻어야 합니다. 이에 귀사가 아래와 같이 본인의 고유식별정보를 처리하는 것에 동의 합니다.<br><br>
                      □ 수집·이용 및 제공 목적<br>
                      ① 정보통신망법 제23조의2 제2항에 따라 인터넷상에서 주민등록번호를 입력하지 않고도 본인임을 확인할 수 있는 휴대폰 본인인증 서비스를 제공하기 위해 고유식별정보를 이용<br>
                      ② "본인확인기관 지정 등에 관한 기준(방송통신위원회 고시)"에 따라 "회사"와 계약한 정보통신서비스 제공자의 연계서비스 및 중복가입확인을 위해 필요한 경우, 다른 본인확인기관이 아래의 고유식별정보를 제공받아 처리하기 위함.<br><br>
                      □ 수집·이용 및 제공하는 고유식별정보 항목<br>
                      ① 주민등록번호(내국인)<br>
                      ② 외국인등록번호(국내거주외국인)<br><br>
                      □ 고유식별정보 보유 및 이용기간<br>
                      고유식별정보의 수집·이용 및 제공 목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다.<br>
                      다만, 전자상거래 등에서의 소비자보호에 관한 법률 등 관련법령의 규정에 의하여 일정기간 보유하여야 할 필요가 있을 경우에는 일정기간 보유합니다.<br>
                      - 계약 또는 청약철회 등에 관한 기록 : 5년<br>
                      - 대금결제 및 재화등의 공급에 관한 기록 : 5년<br>
                      - 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년<br>
                      - 기타 다른 법률의 규정에 의하여 보유가 허용되는 기간<br><br>
                      □ 동의거부 및 거부시 불이익<br>
                      고유식별정보 수집·이용 및 제공에 대한 동의는 거부할 수 있으며, 동의 후에도 철회 가능합니다. 다만, 동의 거부 및 철회 시에는 서비스 이용이 제한될 수 있습니다.
                    </v-card-text>
                  </v-card>
                </v-window-item>
                <v-window-item value="tab02_2_2">
                  <v-card 
                    flat
                    rounded="0"
                  >
                    <v-card-text>
                      [(주)케이티 귀중]<br>
                      주)케이티 (이하 "본인확인기관")가 코리아크레딧뷰로(주) (이하 "회사")을 통해 제공하는 휴대폰 본인확인 서비스 관련하여 이용자로부터 수집한 고유식별정보를 이용하거나 타인에게 제공할 때에는 '정보통신망 이용촉진 및 정보보호 등에 관한 법률'(이하 "정보통신망법")에 따라 이용자의 동의를 얻어야 합니다.<br><br>
                      ■ 제 1 조 [고유식별정보의 처리 동의]<br>
                      "본인확인기관"은 정보통신망법 제23조의2 제2항에 따라 인터넷상에서 주민등록번호를 입력하지 않고도 본인임을 확인할 수 있는 휴대폰 본인확인서비스를 제공하기 위해 고유식별정보를 처리합니다.<br><br>
                      ■ 제 2 조 [고유식별정보의 제공 동의]<br>
                      "본인확인기관 지정 등에 관한 기준(방송통신위원회 고시)"에 따라 "회사"와 계약한 정보통신서비스 제공자 의 연계서비스 및 중복가입확인을 위해 아래와 같이 본인의 고유식별정보를 '다른 본인확인기관'에 제공하는 것에 동의합니다.<br><br>
                      1. 제공자(본인확인기관)<br>
                      (주)케이티<br>
                      2. 제공 받는자(본인확인기관)<br>
                      코리아크레딧뷰로㈜, SCI평가정보㈜<br>
                      3. 제공하는 항목<br>
                      주민등록번호(내국인), 외국인등록번호(국내거주외국인)<br>
                      4. 제공 목적<br>
                      CI(연계정보), DI(중복가입확인정보)의 생성 및 전달<br>
                      5. 보유 및 이용기간<br>
                      CI(연계정보), DI(중복가입확인정보) 생성 즉시 폐기<br>
                      6. 위 개인정보 제공에 동의하지 않으실 경우, 서비스를 이용할 수 없습니다.<br><br>
                      <코리아크레딧뷰로㈜ 귀중><br>
                      귀사가 에스케이텔레콤㈜, ㈜케이티, LG유플러스㈜ 등 통신사로부터 위탁 받아 제공하는 휴대폰본인확인서비스 이용과 관련하여, 본인의 개인정보를 수집·이용하고자 하는 경우 「개인정보보호법」 제17조, 제22조, 제24조, 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」 제24조의2에 따라 제3자에게 제공할 경우 본인의 사전동의를 얻어야 합니다. 이에 귀사가 아래와 같이 본인의 고유식별정보를 처리하는 것에 동의 합니다.<br><br>
                      □ 수집·이용 및 제공 목적<br>
                      ① 정보통신망법 제23조의2 제2항에 따라 인터넷상에서 주민등록번호를 입력하지 않고도 본인임을 확인할 수 있는 휴대폰 본인인증 서비스를 제공하기 위해 고유식별정보를 이용<br>
                      ② "본인확인기관 지정 등에 관한 기준(방송통신위원회 고시)"에 따라 "회사"와 계약한 정보통신서비스 제공자의 연계서비스 및 중복가입확인을 위해 필요한 경우, 다른 본인확인기관이 아래의 고유식별정보를 제공받아 처리하기 위함.<br><br>
                      □ 수집·이용 및 제공하는 고유식별정보 항목<br>
                      ① 주민등록번호(내국인)<br>
                      ② 외국인등록번호(국내거주외국인)<br><br>
                      □ 고유식별정보 보유 및 이용기간<br>
                      고유식별정보의 수집·이용 및 제공 목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다.<br>
                      다만, 전자상거래 등에서의 소비자보호에 관한 법률 등 관련법령의 규정에 의하여 일정기간 보유하여야 할 필요가 있을 경우에는 일정기간 보유합니다.<br>
                      - 계약 또는 청약철회 등에 관한 기록 : 5년<br>
                      - 대금결제 및 재화등의 공급에 관한 기록 : 5년<br>
                      - 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년<br>
                      - 기타 다른 법률의 규정에 의하여 보유가 허용되는 기간<br><br>
                      □ 동의거부 및 거부시 불이익<br>
                      고유식별정보 수집·이용 및 제공에 대한 동의는 거부할 수 있으며, 동의 후에도 철회 가능합니다. 다만, 동의 거부 및 철회 시에는 서비스 이용이 제한될 수 있습니다.
                    </v-card-text>
                  </v-card>
                </v-window-item>
                <v-window-item value="tab02_2_3">
                  <v-card 
                    flat
                    rounded="0"
                  >
                    <v-card-text>
                      [LG유플러스(주) 귀중]<br>
                      LG유플러스(주)(이하 ‘회사’)가 휴대폰본인확인서비스(이하 ‘서비스’)를 제공하기 위해 고유식별정보를 다음과 같이 제3자에게 제공 및 처리 하는 데에 동의합니다.<br><br>
                      1. 고유식별정보를 제공받는자<br>
                      - NICE평가정보㈜, SCI평가정보(주), 코리아크레딧뷰로(주)<br>
                      2. 고유식별정보를 제공받는자의 목적<br>
                      - 연계정보(CI)와 중복가입확인정보(DI)의 생성 및 ‘회사’ 제공<br>
                      - 부정 이용 방지 및 민원 처리<br>
                      3. 고유식별정보 제공 항목: ‘회사’가 보유하고 있는 고객의 주민등록번호와 외국인등록번호<br>
                      4. 고유식별정보를 제공받는 자의 보유 및 이용기간: 제공받는자의 개인정보취급방침에 따름<br>
                      5. 상기 고유식별정보 처리에 대한 내용에 동의하지 않으실 경우, ‘서비스’를 이용할 수 없습니다.<br>
                      상기와 같이 고유식별정보 이용 및 처리에 동의합니다.<br><br>
                      <코리아크레딧뷰로㈜ 귀중><br>
                      귀사가 에스케이텔레콤㈜, ㈜케이티, LG유플러스㈜ 등 통신사로부터 위탁 받아 제공하는 휴대폰본인확인서비스 이용과 관련하여, 본인의 개인정보를 수집·이용하고자 하는 경우 「개인정보보호법」 제17조, 제22조, 제24조, 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」 제24조의2에 따라 제3자에게 제공할 경우 본인의 사전동의를 얻어야 합니다. 이에 귀사가 아래와 같이 본인의 고유식별정보를 처리하는 것에 동의 합니다.<br><br>
                      □ 수집·이용 및 제공 목적<br>
                      ① 정보통신망법 제23조의2 제2항에 따라 인터넷상에서 주민등록번호를 입력하지 않고도 본인임을 확인할 수 있는 휴대폰 본인인증 서비스를 제공하기 위해 고유식별정보를 이용<br>
                      ② "본인확인기관 지정 등에 관한 기준(방송통신위원회 고시)"에 따라 "회사"와 계약한 정보통신서비스 제공자의 연계서비스 및 중복가입확인을 위해 필요한 경우, 다른 본인확인기관이 아래의 고유식별정보를 제공받아 처리하기 위함.<br><br>
                      □ 수집·이용 및 제공하는 고유식별정보 항목<br>
                      ① 주민등록번호(내국인)<br>
                      ② 외국인등록번호(국내거주외국인)<br><br>
                      □ 고유식별정보 보유 및 이용기간<br>
                      고유식별정보의 수집·이용 및 제공 목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다.<br>
                      다만, 전자상거래 등에서의 소비자보호에 관한 법률 등 관련법령의 규정에 의하여 일정기간 보유하여야 할 필요가 있을 경우에는 일정기간 보유합니다.<br>
                      - 계약 또는 청약철회 등에 관한 기록 : 5년<br>
                      - 대금결제 및 재화등의 공급에 관한 기록 : 5년<br>
                      - 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년<br>
                      - 기타 다른 법률의 규정에 의하여 보유가 허용되는 기간<br><br>
                      □ 동의거부 및 거부시 불이익<br>
                      고유식별정보 수집·이용 및 제공에 대한 동의는 거부할 수 있으며, 동의 후에도 철회 가능합니다. 다만, 동의 거부 및 철회 시에는 서비스 이용이 제한될 수 있습니다.
                    </v-card-text>
                  </v-card>
                </v-window-item>
              </v-window>
            </v-window-item>
          </v-window>
        </v-card>
      </div>
      <v-btn
        @click="agree = false"
        variant="text"
        class="btn-popup-close"
      >
        <span class="sr-only">닫기</span>
      </v-btn>
    </div>
    <!-- // 고유식별정보 처리 동의 -->
  </v-dialog>
</template>

<style scoped>
.v-btn--size-default {
  font-size: 1.4rem;
}
</style>