<script setup>
import { ref } from 'vue';

const terms = ref(false);
</script>

<template>
  <v-dialog v-model="terms">
    <!-- 샘플 버튼 -->
    <template v-slot:activator="{ props: activatorProps }">
      <v-btn v-bind="activatorProps">
        이용약관 팝업
      </v-btn>
    </template>
    <!-- // 샘플 버튼 -->

    <!-- 서비스 이용약관 -->
    <div class="popup-wrap medium">
      <div class="popup-head">
        <h3 class="h-title">이용약관</h3>
      </div>
      <div class="popup-cont">
        <div class="terms-cont">
          <h3 class="t-tit0">제 1장 총칙</h3>
          <h4 class="t-tit1">제 1조 (목적)</h4>
          <p>이 약관은 신한카드 주식회사(이하 "회사"라고 합니다.) 운영하는 DataBada를 이용하는 것과 관련하여 필요한 회원의 권리·의무 및 책임사항, 이용조건 및 절차, 기타 필요한 사항 등을 규정함을 목적으로 합니다.</p>
          <h4 class="t-tit1">제 2조 (용어의 정의)</h4>
          <ol>
            <li>① 본 약관에서 사용하는 용어의 정의는 다음과 같습니다.
              <ol>
                <li>1. 'DataBada'(이하 '홈페이지' 또는 '서비스'라 함)란 회사가 제공하는 서비스 (데이터 서비스, 솔루션서비스, 광고서비스 등)와 이를 안내하고 회사가 정한 방법에 따라서 회원이 해당 서비스를 신청할 수 있는 홈페이지 등 채널을 통칭합니다.
                  <ol>
                    <li>가)	데이터 서비스: 회사가 보유한 빅데이터를 활용하여 데이터셋, 모델링, 이슈분석 및 리포트 등을 제공하는 서비스</li>
                    <li>나)	솔루션 서비스: 회사가 보유한 데이터를 활용한 상권분석 솔루션, 기업•산업 모니터링 솔루션 등을 제공하는 서비스</li>
                    <li>다)	광고 서비스: 회사의 고객에게 ‘회원’이 요청한 메시지나 서베이, 광고 베너를 전달 및 수행하는 광고/마케팅 서비스</li>
                    <li>라)	API 서비스: API 기반 데이터 상품을 제공하는 서비스</li>
                  </ol>
                </li>
                <li>2. 'DataBada 회원'(이하 '회원')이란 회사가 정한 절차에 따라 DataBada 홈페이지에 가입한 고객 또는 ‘회사’와 별도 계약을 통해 정상적으로 DataBada 서비스를 이용할 수 있는 권한을 부여 받은 고객을 말합니다.</li>
              </ol>
            </li>
            <li>②	기타 본 조에서 정하지 않은 용어에 대해서는 서비스 안내 및 관계 법령에 정한 바에 따릅니다.</li>
          </ol>
          <h4 class="t-tit1">제 3조 (약관 등의 명시와 설명 및 개정)</h4>
          <ol>
            <li>①	회사는 이 약관의 내용과 상호 및 소재지, 연락처(이메일 등), 사업자등록번호, 개인정보 보호책임자 등을 이용자가 쉽게 알 수 있도록 DataBada 홈페이지에 게시합니다.</li>
            <li>②	회사는「전자상거래 등에서의 소비자보호에 관한 법률」,「약관의 규제에 관한 법률」,「전자문서 및 전자거래기본법」,「전자금융거래법」,「전자서명법」,「정보통신망 이용촉진 및 정보보호 등에 관한 법률」,「소비자기본법」등 관련 법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.</li>
          </ol>
          <h4 class="t-tit1">제 4조 (약관의 효력 및 변경)</h4>
          <ol>
            <li>①	본 약관은 DataBada 이용을 희망하는 고객이 본 약관에 동의하고 DataBada에 가입하여 회원이 됨과 동시에 효력이 발생합니다.</li>
            <li>②	회사는 본 약관을 개정하는 경우 적용일자 및 개정사유를 명시하여 현행 약관과 함께 DataBada 홈페이지에 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다. 다만, 회원에게 불리하게 약관 내용을 변경하는 경우에는 최소한 30일 이상의 사전유예기간을 두고 공지하며 회원이 입력한 이메일 등을 통해 따로 통지합니다. 이 경우 회사는 DataBada 에 개정 전 내용과 개정 후 내용을 명확하게 비교하여 회원이 알기 쉽도록 표시합니다. 단, 법령의 재개정에 따라 변경이 필요한 사항의 경우 즉시 시행할 수 있습니다.</li>
            <li>③	회사가 제2항에 따라 7일간 또는 이용자에게 불리하거나 중대한 사항의 변경의 경우에는 30일 기간 내에 회원에게 개정약관을 공지 또는 통지하였음에도 회원이 명시적으로 거부의 의사표시를 하지 아니한 경우 회원이 개정약관에 동의한 것으로 봅니다.</li>
            <li>④	개정 약관에 동의하지 않는 회원은 본 약관 제6조에 따라 탈퇴할 수 있습니다.</li>
            <li>⑤	이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 전자상거래 등에서의 소비자보호에 관한 법률, 약관의 규제 등에 관한 법률, 공정거래위원회가 정하는 전자상거래 등에서의 소비자 보호지침 및 관계법령 또는 상관례에 따릅니다.</li>
          </ol>
          <h3 class="t-tit0">제 2장 서비스 이용계약</h3>
          <h4 class="t-tit1">제 5조 (회원 가입 및 가입 계약의 성립)</h4>
          <ol>
            <li>①	회원은 회사가 정한 가입 양식에 따라 회원정보를 기입한 후 이 약관에 동의한다는 의사표시를 함으로서 회원가입을 신청합니다.</li>
            <li>②	회원가입을 신청한 자는 다음 각 호에 해당하지 않는 한 회원으로 등록됩니다.
              <ol>
                <li>1. 실명이 아니거나 타인의 명의를 이용한 경우</li>
                <li>2. 허위의 정보를 기재하거나, 회사가 제시하는 필수 기재 사항을 입력하지 않은 경우</li>
                <li>3. 약관에 위배되거나 위법 또는 부당한 회원가입 신청이 확인되는 경우 및 회사의 합리적인 판단에 의하여 신청 거절이 필요하다고 인정되는 경우</li>
              </ol>
            </li>
            <li>③	회원 가입 신청과 관련하여 회사는 가입신청자에게 본인확인기관을 통한 실명확인 및 본인인증을 요청할 수 있습니다.</li>
            <li>④	회원가입 신청은 본인이 직접 이행 하셔야 하며, 이를 타인이 대신하게 하거나 인증번호 및 비밀번호 등의 정보를 타인에게 노출하여서는 안됩니다. 다만, 특수한 사정으로 회사가 인정하는 경우 회원의 서비스 신청을 대행하여 진행할 수 있습니다.</li>
            <li>⑤	가입신청자의 회원가입 신청을 회사가 승낙함으로써 회원가입이 이루어지고 아이디(ID)가 부여되면 서비스 이용이 가능해 집니다. 가입 승낙의 의사표시는 해당 서비스화면에 게시하거나 이메일 또는 기타 방법으로 통지합니다.</li>
            <li>⑥	회원은 회원가입 시 등록한 사항에 변경이 있는 경우, 상당한 기간 이내에 회사에 대하여 회원정보 수정 등의 방법으로 그 변경사항을 알려야 합니다.</li>
          </ol>
          <h4 class="t-tit1">제 6조 (회원탈퇴 및 자격 상실 등)</h4>
          <ol>
            <li>①	회원은 언제든지 회사에 요청하여 DataBada 에서 탈퇴할 수 있습니다. 단, 별도로 체결한 계약에 따라서 당사자가 권리의무가 존속하는 경우에는 별도로 체결한 계약 상 계약기간 동안 서비스가 제공됩니다.</li>
            <li>②	회원이 다음 각 호의 사유에 해당하는 경우, 회사는 회원자격을 제한 및 정지시킬 수 있습니다.
              <ol>
                <li>1. DataBada의 원활한 진행을 방해하는 행위를 하거나 시도한 경우</li>
                <li>2. 회원이 제공한 정보 또는 그에 관한 증빙자료가 허위이거나 회사에서 정당하게 요청하는 증빙자료를 회원이 제공하지 않는 경우</li>
                <li>3. DataBada 서비스를 통해서 제공받은 데이터를 계약 목적 외 활용, 재판매 등 악용하거나 시도한 경우</li>
                <li>4. 기타 회사의 합리적인 판단에 의하여 계약 해지가 필요하다고 인정되는 경우</li>
                <li>5. 제6조 제2항 각 호 중 어느 하나의 사유가 사후적으로 확인된 경우</li>
              </ol>
            </li>
            <li>③	회사는 회원에게 이메일을 통하여 해지 사유를 밝혀 해지 의사를 통지합니다. 회사가 서비스 이용계약을 해지하는 경우, 회사가 회원에게 해지 의사표시를 발송한 시점에 해지됩니다.</li>
          </ol>
          <h4 class="t-tit1">제 7조 (회원에 대한 고지 및 통지 방법)</h4>
          <ol>
            <li>①	DataBada 서비스 운영과 관련한 공지사항 및 각종 정보는 홈페이지에 게재하는 방법으로 회원에게 제공합니다.</li>
            <li>②	법령 또는 본 약관 상 별도로 정한 바가 없는 한, 회사는 불특정다수 회원에 대한 통지의 경우 1주일 이상 DataBada 홈페이지에 게시함으로서 개별 통지에 갈음할 수 있습니다.</li>
            <li>③	전항에도 불구하고 회원 본인의 거래와 관련된 중대한 영향을 미치는 사항에 대하여는 회원이 제공한 이메일을 통하여(또는 회원이 별도 계약 상 요구한 방법이 있다면 해당 방법으로) 개별 통지를 합니다.</li>
            <li>④	회원은 회사에 실제로 연락이 가능한 이메일 주소, 전화번호 등의 정확한 정보를 제공하고 해당 정보들을 최신으로 유지하여야 하며, 회원정보가 변경되었음에도 해당 사항을 수정하지 않거나 잘못 수정함으로써 발생한 각종 불이익은 회원이 부담하여야 합니다.</li>
          </ol>
          <h3 class="t-tit0">제 3장 서비스 이용</h3>
          <h4 class="t-tit1">제 8조 (서비스의 이용)</h4>
          <ol>
            <li>①	회원은 본 약관에 따른 회원가입 후 DataBada 홈페이지에서 서비스에 대한 신청 문의를 할 수 있습니다. 단, 신청 가능한 서비스는 회사의 정책에 따라서 변경될 수 있습니다.</li>
            <li>②	회원이 별도의 계약에 따라 회사와 DataBada에서 제공하는 서비스 관련 계약을 체결한 경우, DataBada 홈페이지를 통해서 이용이 가능합니다. 이를 위해서는 본 약관에 따른 회원가입이 필요할 수 있습니다.</li>
          </ol>
          <h4 class="t-tit1">제 9조 (정보의 제공)</h4>
          <ol>
            <li>①	회사는 서비스 운영과 관련한 각종 정보, 공지사항, 안내사항은 제 7조에 따라 제공합니다.</li>
            <li>②	회사는 회원에게 서비스 제공 시 홈페이지에서 조회하는 방식 등 회사가 정한 방식에 따라서 정보 제공할 수 있습니다. 단, 별도 계약에서 정한 바가 있다면 이에 따릅니다.</li>
            <li>③	회사는 정보를 제공함에 있어서 보안성과 안전성을 갖춘 방식으로 제공합니다.</li>
          </ol>
          <h4 class="t-tit1">제 10조 (서비스 이용의 일시 중단)</h4>
          <ol>
            <li>①	회사는 다음 각 호의 어느 하나에 해당하는 사유가 있는 경우 DataBada 홈페이지를 통한서비스 및 API 서비스의 이용을 일시적으로 중단하거나 제한할 수 있습니다.
              <ol>
                <li>1. 컴퓨터 등 정보통신 설비의 보수/업그레이드/점검/교체/고장, 통신장애, 해킹 등으로 정상적인 이용이 어려운 경우</li>
                <li>2. 정전, 제반 설비의 장애 또는 이용량의 폭주 등으로 정상적인 이용에 지장이 있는 경우</li>
                <li>3. 국가비상사태 등 기타 불가항력적 사유가 발생한 경우</li>
              </ol>
            </li>
            <li>②	회사는 전항의 사유로 서비스의 이용을 중단 또는 제한하고자 하는 경우에는 홈페이지, 서면, 전자우편, SMS 중 1가지 이상의 방법을 통해 3영업일 이전에 그 사유와 내용을 사전에 회원에게 통지합니다. 다만, 전산 장애 발생 등의 불가피한 사유로 긴급하게 이용을 중단하거나 제한할 필요가 있는 경우에는 사유 발생 즉시 공지하거나 통지할 수 있습니다.</li>
            <li>③	회사는 서비스 이용의 일시 중단 상태가 해소되는 경우 사유 발생 당일에 홈페이지, 서면, 전자우편, SMS 중 1가지 이상의 방법을 통해 회원께 알려드립니다.</li>
          </ol>
          <h4 class="t-tit1">제 11조 (서비스 이용 정지 및 해지)</h4>
          <ol>
            <li>①	회사는 회원에게 다음 각 호의 어느 하나에 해당하는 사유가 있는 경우 이메일을 통해 사유 발생 당일 고지 후 DataBada 홈페이지를 통한 서비스 이용을 정지할 수 있습니다. 단, 개별 계약에서 정한 사유가 있다면 해당 시에도 정지할 수 있습니다.
              <ol>
                <li>1. 회원의 고의·과실로 인해 법령 또는 이 약관을 위반하여 계약의 목적 달성이 어려운 경우</li>
                <li>2. 신청 내용의 필수 기재사항 등 중요 기재사항을 허위로 작성한 경우</li>
                <li>3. 이용정지·해지 등 회원이 서비스를 정상적으로 이용할 수 없는 경우</li>
                <li>4. 회원의 암호화된 동일인 식별정보(이하 "CI")가 효력을 상실하거나 회원이 CI 수집 활용 동의를 철회한 경우</li>
                <li>5. 바이러스 프로그램 유포, 해킹 등 부정한 방법을 사용하여 회사에 피해발생이 우려되거나 피해가 발생 한 경우</li>
                <li>6. 서비스의 이용 목적을 벗어난 회원 개인의 영리목적 또는 부정한 방법으로 이용한 경우</li>
              </ol>
            </li>
            <li>②	회사는 회원의 서비스 이용 정지 상태가 해소되는 경우 사유 발생 당일에 이메일을 통해 회원에게 안내합니다.</li>
            <li>③	서비스 이용계약의 해지는 개별 계약에서 정한 사항을 따릅니다.</li>
            <li>④ 제 11조 제1항의 조치에 대하여 회원은 회사에 이의 신청을 할 수 있으며, 이의 신청이 적당하다고 회사가 인정하는 경우에 회사는 즉시 서비스의 이용을 재개하여야 합니다.</li>
          </ol>
          <h4 class="t-tit1">제 12조 (양도 및 증여)</h4>
          <p>회원은 서비스의 이용권한, 기타 이용 계약상 지위를 타인에게 양도, 증여할 수 없습니다.</p>
          <h3 class="t-tit0">제 4장 계약당사자의 의무</h3>
          <h4 class="t-tit1">제 13조 (회사의 의무)</h4>
          <p>회사는 본 약관에서 정한 바에 따라 지속적, 안정적으로 서비스를 제공합니다.</p>
          <h4 class="t-tit1">제 14조 (회원의 의무)</h4>
          <ol>
            <li>①	회원은 반드시 본인명의로만 서비스를 이용해야 하며, 아이디(ID) 및 비밀번호에 대한 관리책임은 회원에게 있으며, 회원은 어떠한 경우에도 본인의 아이디(ID) 또는 비밀번호를 타인에게 양도, 대여, 누설 또는 노출하거나 이와 유사한 행위를 해서는 아니됩니다.</li>
            <li>②	회원이 아이디(ID) 또는 비밀번호를 도난당하거나 제3자가 무단으로 이를 사용하고 있음을 인지한 경우, 이를 즉시 회사에 통보하여야 하고, 회사의 안내가 있는 경우에는 그에 따라야 합니다.</li>
            <li>③	회원이 퇴사 및 부서이동으로 인하여 이용 서비스에 대한 접근 권한이 중단 또는 변경 되어야하는 경우 이를 회사에 통보 해야합니다.</li>
            <li>④	회사의 귀책사유에 의하지 아니한 아이디(ID) 또는 비밀번호의 유출, 양도, 대여로 인한 손실 및 손해에 대하여 회사는 아무런 책임을 지지 않습니다.</li>
            <li>⑤	회원은 계약으로 인해 수신된 데이터를 계약 목적에 한하여 사용해야하며, 외부 유출 등으로부터 안전하게 관리해야 합니다.</li>
            <li>⑥	회원은 관계 법령, 본 약관의 규정 등을 준수하여야 합니다.</li>
            <li>⑦	본 조의 의무를 고의 또는 중과실로 위반하여 발생하는 책임의 전부 또는 일부는 회원에게 있습니다.</li>
          </ol>
          <h4 class="t-tit1">제 15조 (회원의 개인정보 보호)</h4>
          <ol>
            <li>①	회사는 관련법령이 정하는 바에 따라서 회원 등록정보를 포함한 회원의 개인정보를 보호합니다. 회원의 개인정보 보호에 관련된 사항은 관련 법령 및 회사가 정하는 개인정보 처리방침 에 정한 바에 의합니다.</li>
            <li>②	회사는 회원 탈회 후 중요 정보는 계약 정보 관리를 위하여 삭제하지 않습니다.</li>
            <li>③	회사는 회원의 개인정보 보호를 위하여 관리자의 수를 최소한으로 한정하며, 회원의 개인 정보의 분실, 도난 유출 등으로 야기된 회원의 손해에 대해 책임을 부담합니다. 단, 회사가 고의 또는 과실이 없음을 증명한 경우에는 그러하지 아니합니다.</li>
            <li>④	회사는 관련 법령에서 정한 바에 따라 회원의 정보를 관리하여야 하며, 이에 대한 세부적인 내용은 회사의 개인정보취급방침에 정한 바에 따릅니다. 회사는 개인정보취급방침에 대한 세부 내용을 DataBada 홈페이지에 게시하여 회원이 확인할 수 있도록 합니다.</li>
          </ol>
          <h4 class="t-tit1">제 16조 (지식재산권의 귀속 및 이용제한)</h4>
          <ol>
            <li>①	회사가 작성한 저작물에 대한 저작권 기타 지식재산권은 회사에 귀속합니다.</li>
            <li>②	회원은 DataBada를 이용함으로써 얻은 정보 중 회사에게 지적재산권이 귀속된 정보를 회사의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.</li>
          </ol>
          <h3 class="t-tit0">제 5장 손해배상 등</h3>
          <h4 class="t-tit1">제 17조 (관할법원)</h4>
          <p>이 약관에 따른 거래에 관하여 분쟁이 발생하는 경우에는 회원의 주소지 또는 영업소 소재지를 관할하는 법원을 제1심 관할법원으로 합니다.</p>
          <h4 class="t-tit1">제 18조 (약관에서 정하지 아니한 사항)</h4>
          <p>본 약관에서 정하지 아니한 사항과 본 약관의 해석에 관하여는 전자금융거래법 등 관계법령, 상관례, 표준 전자금융거래기본약관에 따릅니다.</p>
          <h4 class="t-tit1">부칙</h4>
          <p>1. 본 약관은 2024년 7월 1일부터 시행합니다.</p>
        </div>
      </div>
      <div class="popup-foot">
        <div class="btn-popwrap">
          <v-btn
            variant="flat"
            color="primary"
            size="x-large"
            rounded="md"
            class="default"
          >
            확인
          </v-btn>
        </div>
      </div>
      <v-btn
        @click="terms = false"
        variant="text"
        class="btn-popup-close"
      >
        <span class="sr-only">닫기</span>
      </v-btn>
    </div>
    <!-- // 서비스 이용약관 -->
  </v-dialog>
</template>

<style scoped>
.v-btn--size-default {
  font-size: 1.4rem;
}
</style>