<template>
    <div class="guide-wrap">
        <v-row>
            <h2 class="sub-title">Alert</h2>
            <v-col cols="12">
                <PopupAlert :dialog-info="dialogInfo" @close="closePopup" />
                <v-btn 
                @click="openPopup"
                >팝업 열기
                </v-btn>
            </v-col>
        </v-row>
        <v-row>
            <h2 class="sub-title">Confirm</h2>
            <v-col cols="12">
                <v-dialog v-model="confirm" width="auto">
                    <!-- 샘플 버튼 -->
                    <template v-slot:activator="{ props: activatorProps }">
                        <v-btn v-bind="activatorProps">
                            Confirm 경고창 팝업
                        </v-btn>
                    </template>
                    <!-- // 샘플 버튼 -->

                    <!-- Confirm 경고창 -->
                    <div class="popup-alert-wrap">
                        <div class="alert-cont">
                            <p class="text">경고창 팝업의 내용이 들어갑니다.<br>텍스트는 센터배열 입니다.</p>
                        </div>
                        <div class="alert-foot confirm">
                            <v-btn 
                            variant="text" 
                            class="cancel"
                            >
                                취소
                            </v-btn>
                            <v-btn 
                            variant="text" 
                            class="default" 
                            @click="confirm = false"
                            >
                                확인
                            </v-btn>
                        </div>
                    </div>
                    <!-- // Confirm 경고창 -->
                </v-dialog>
            </v-col>
        </v-row>
        <v-row>
            <h2 class="sub-title">서비스 이용약관</h2>
            <v-col cols="12">
                <v-dialog v-model="terms">
                    <!-- 샘플 버튼 -->
                    <template v-slot:activator="{ props: activatorProps }">
                        <v-btn v-bind="activatorProps">
                            서비스 이용약관 팝업
                        </v-btn>
                    </template>
                    <!-- // 샘플 버튼 -->
                    <!-- 서비스 이용약관 -->
                    <div class="popup-wrap medium">
                        <div class="popup-head">
                            <h3 class="h-title">서비스 이용약관</h3>
                        </div>
                        <div class="popup-cont">
                            <div class="terms-cont">
                                <h3 class="t-tit0">제 1장 총칙</h3>
                                <h4 class="t-tit1">제 1조 (목적)</h4>
                                <p>이 약관은 신한카드 주식회사(이하 "회사"라고 합니다.) 운영하는 DataBada를 이용하는 것과 관련하여 필요한 회원의 권리·의무 및 책임사항,
                                    이용조건 및 절차,
                                    기타 필요한 사항 등을 규정함을 목적으로 합니다.</p>
                                <h4 class="t-tit1">제 2조 (용어의 정의)</h4>
                                <ol>
                                    <li>① 본 약관에서 사용하는 용어의 정의는 다음과 같습니다.
                                        <ol>
                                            <li>1. 'DataBada'(이하 '홈페이지' 또는 '서비스'라 함)란 회사가 제공하는 서비스 (데이터 서비스, 솔루션서비스,
                                                광고서비스 등)와
                                                이를 안내하고 회사가 정한 방법에 따라서 회원이 해당 서비스를 신청할 수 있는 홈페이지 등 채널을 통칭합니다.
                                                <ol>
                                                    <li>가) 데이터 서비스: 회사가 보유한 빅데이터를 활용하여 데이터셋, 모델링, 이슈분석 및 리포트 등을 제공하는 서비스
                                                    </li>
                                                    <li>나) 솔루션 서비스: 회사가 보유한 데이터를 활용한 상권분석 솔루션, 기업•산업 모니터링 솔루션 등을 제공하는
                                                        서비스</li>
                                                    <li>다) 광고 서비스: 회사의 고객에게 ‘회원’이 요청한 메시지나 서베이, 광고 베너를 전달 및 수행하는 광고/마케팅
                                                        서비스</li>
                                                    <li>라) API 서비스: API 기반 데이터 상품을 제공하는 서비스</li>
                                                </ol>
                                            </li>
                                            <li>2. 'DataBada 회원'(이하 '회원')이란 회사가 정한 절차에 따라 DataBada 홈페이지에 가입한 고객 또는 ‘회사’와
                                                별도 계약을
                                                통해 정상적으로 DataBada 서비스를 이용할 수 있는 권한을 부여 받은 고객을 말합니다.</li>
                                        </ol>
                                    </li>
                                    <li>② 기타 본 조에서 정하지 않은 용어에 대해서는 서비스 안내 및 관계 법령에 정한 바에 따릅니다.</li>
                                </ol>
                                <h4 class="t-tit1">제 3조 (약관 등의 명시와 설명 및 개정)</h4>
                                <ol>
                                    <li>① 회사는 이 약관의 내용과 상호 및 소재지, 연락처(이메일 등), 사업자등록번호, 개인정보 보호책임자 등을 이용자가 쉽게 알 수 있도록
                                        DataBada
                                        홈페이지에 게시합니다.</li>
                                    <li>② 회사는「전자상거래 등에서의 소비자보호에 관한 법률」,「약관의 규제에 관한 법률」,「전자문서 및
                                        전자거래기본법」,「전자금융거래법」,「전자서명법」,「정보통신망
                                        이용촉진 및 정보보호 등에 관한 법률」,「소비자기본법」등 관련 법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.</li>
                                </ol>
                                <h4 class="t-tit1">제 4조 (약관의 효력 및 변경)</h4>
                                <ol>
                                    <li>① 본 약관은 DataBada 이용을 희망하는 고객이 본 약관에 동의하고 DataBada에 가입하여 회원이 됨과 동시에 효력이 발생합니다.
                                    </li>
                                    <li>② 회사는 본 약관을 개정하는 경우 적용일자 및 개정사유를 명시하여 현행 약관과 함께 DataBada 홈페이지에 그 적용일자 7일 이전부터
                                        적용일자 전일까지
                                        공지합니다. 다만, 회원에게 불리하게 약관 내용을 변경하는 경우에는 최소한 30일 이상의 사전유예기간을 두고 공지하며 회원이 입력한 이메일 등을
                                        통해 따로
                                        통지합니다. 이 경우 회사는 DataBada 에 개정 전 내용과 개정 후 내용을 명확하게 비교하여 회원이 알기 쉽도록 표시합니다. 단, 법령의
                                        재개정에 따라
                                        변경이 필요한 사항의 경우 즉시 시행할 수 있습니다.</li>
                                    <li>③ 회사가 제2항에 따라 7일간 또는 이용자에게 불리하거나 중대한 사항의 변경의 경우에는 30일 기간 내에 회원에게 개정약관을 공지 또는
                                        통지하였음에도 회원이
                                        명시적으로 거부의 의사표시를 하지 아니한 경우 회원이 개정약관에 동의한 것으로 봅니다.</li>
                                    <li>④ 개정 약관에 동의하지 않는 회원은 본 약관 제6조에 따라 탈퇴할 수 있습니다.</li>
                                    <li>⑤ 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 전자상거래 등에서의 소비자보호에 관한 법률, 약관의 규제 등에 관한 법률,
                                        공정거래위원회가
                                        정하는 전자상거래 등에서의 소비자 보호지침 및 관계법령 또는 상관례에 따릅니다.</li>
                                </ol>
                                <h3 class="t-tit0">제 2장 서비스 이용계약</h3>
                                <h4 class="t-tit1">제 5조 (회원 가입 및 가입 계약의 성립)</h4>
                                <ol>
                                    <li>① 회원은 회사가 정한 가입 양식에 따라 회원정보를 기입한 후 이 약관에 동의한다는 의사표시를 함으로서 회원가입을 신청합니다.</li>
                                    <li>② 회원가입을 신청한 자는 다음 각 호에 해당하지 않는 한 회원으로 등록됩니다.
                                        <ol>
                                            <li>1. 실명이 아니거나 타인의 명의를 이용한 경우</li>
                                            <li>2. 허위의 정보를 기재하거나, 회사가 제시하는 필수 기재 사항을 입력하지 않은 경우</li>
                                            <li>3. 약관에 위배되거나 위법 또는 부당한 회원가입 신청이 확인되는 경우 및 회사의 합리적인 판단에 의하여 신청 거절이 필요하다고
                                                인정되는 경우
                                            </li>
                                        </ol>
                                    </li>
                                    <li>③ 회원 가입 신청과 관련하여 회사는 가입신청자에게 본인확인기관을 통한 실명확인 및 본인인증을 요청할 수 있습니다.</li>
                                    <li>④ 회원가입 신청은 본인이 직접 이행 하셔야 하며, 이를 타인이 대신하게 하거나 인증번호 및 비밀번호 등의 정보를 타인에게 노출하여서는
                                        안됩니다. 다만,
                                        특수한 사정으로 회사가 인정하는 경우 회원의 서비스 신청을 대행하여 진행할 수 있습니다.</li>
                                    <li>⑤ 가입신청자의 회원가입 신청을 회사가 승낙함으로써 회원가입이 이루어지고 아이디(ID)가 부여되면 서비스 이용이 가능해 집니다. 가입 승낙의
                                        의사표시는 해당
                                        서비스화면에 게시하거나 이메일 또는 기타 방법으로 통지합니다.</li>
                                    <li>⑥ 회원은 회원가입 시 등록한 사항에 변경이 있는 경우, 상당한 기간 이내에 회사에 대하여 회원정보 수정 등의 방법으로 그 변경사항을 알려야
                                        합니다.</li>
                                </ol>
                                <h4 class="t-tit1">제 6조 (회원탈퇴 및 자격 상실 등)</h4>
                                <ol>
                                    <li>① 회원은 언제든지 회사에 요청하여 DataBada 에서 탈퇴할 수 있습니다. 단, 별도로 체결한 계약에 따라서 당사자가 권리의무가 존속하는
                                        경우에는 별도로
                                        체결한 계약 상 계약기간 동안 서비스가 제공됩니다.</li>
                                    <li>② 회원이 다음 각 호의 사유에 해당하는 경우, 회사는 회원자격을 제한 및 정지시킬 수 있습니다.
                                        <ol>
                                            <li>1. DataBada의 원활한 진행을 방해하는 행위를 하거나 시도한 경우</li>
                                            <li>2. 회원이 제공한 정보 또는 그에 관한 증빙자료가 허위이거나 회사에서 정당하게 요청하는 증빙자료를 회원이 제공하지 않는 경우
                                            </li>
                                            <li>3. DataBada 서비스를 통해서 제공받은 데이터를 계약 목적 외 활용, 재판매 등 악용하거나 시도한 경우</li>
                                            <li>4. 기타 회사의 합리적인 판단에 의하여 계약 해지가 필요하다고 인정되는 경우</li>
                                            <li>5. 제6조 제2항 각 호 중 어느 하나의 사유가 사후적으로 확인된 경우</li>
                                        </ol>
                                    </li>
                                    <li>③ 회사는 회원에게 이메일을 통하여 해지 사유를 밝혀 해지 의사를 통지합니다. 회사가 서비스 이용계약을 해지하는 경우, 회사가 회원에게 해지
                                        의사표시를 발송한
                                        시점에 해지됩니다.</li>
                                </ol>
                                <h4 class="t-tit1">제 7조 (회원에 대한 고지 및 통지 방법)</h4>
                                <ol>
                                    <li>① DataBada 서비스 운영과 관련한 공지사항 및 각종 정보는 홈페이지에 게재하는 방법으로 회원에게 제공합니다.</li>
                                    <li>② 법령 또는 본 약관 상 별도로 정한 바가 없는 한, 회사는 불특정다수 회원에 대한 통지의 경우 1주일 이상 DataBada 홈페이지에
                                        게시함으로서 개별
                                        통지에 갈음할 수 있습니다.</li>
                                    <li>③ 전항에도 불구하고 회원 본인의 거래와 관련된 중대한 영향을 미치는 사항에 대하여는 회원이 제공한 이메일을 통하여(또는 회원이 별도 계약 상
                                        요구한 방법이
                                        있다면 해당 방법으로) 개별 통지를 합니다.</li>
                                    <li>④ 회원은 회사에 실제로 연락이 가능한 이메일 주소, 전화번호 등의 정확한 정보를 제공하고 해당 정보들을 최신으로 유지하여야 하며, 회원정보가
                                        변경되었음에도
                                        해당 사항을 수정하지 않거나 잘못 수정함으로써 발생한 각종 불이익은 회원이 부담하여야 합니다.</li>
                                </ol>
                                <h3 class="t-tit0">제 3장 서비스 이용</h3>
                                <h4 class="t-tit1">제 8조 (서비스의 이용)</h4>
                                <ol>
                                    <li>① 회원은 본 약관에 따른 회원가입 후 DataBada 홈페이지에서 서비스에 대한 신청 문의를 할 수 있습니다. 단, 신청 가능한 서비스는
                                        회사의 정책에
                                        따라서 변경될 수 있습니다.</li>
                                    <li>② 회원이 별도의 계약에 따라 회사와 DataBada에서 제공하는 서비스 관련 계약을 체결한 경우, DataBada 홈페이지를 통해서 이용이
                                        가능합니다. 이를
                                        위해서는 본 약관에 따른 회원가입이 필요할 수 있습니다.</li>
                                </ol>
                                <h4 class="t-tit1">제 9조 (정보의 제공)</h4>
                                <ol>
                                    <li>① 회사는 서비스 운영과 관련한 각종 정보, 공지사항, 안내사항은 제 7조에 따라 제공합니다.</li>
                                    <li>② 회사는 회원에게 서비스 제공 시 홈페이지에서 조회하는 방식 등 회사가 정한 방식에 따라서 정보 제공할 수 있습니다. 단, 별도 계약에서 정한
                                        바가 있다면
                                        이에 따릅니다.</li>
                                    <li>③ 회사는 정보를 제공함에 있어서 보안성과 안전성을 갖춘 방식으로 제공합니다.</li>
                                </ol>
                                <h4 class="t-tit1">제 10조 (서비스 이용의 일시 중단)</h4>
                                <ol>
                                    <li>① 회사는 다음 각 호의 어느 하나에 해당하는 사유가 있는 경우 DataBada 홈페이지를 통한서비스 및 API 서비스의 이용을 일시적으로
                                        중단하거나 제한할
                                        수 있습니다.
                                        <ol>
                                            <li>1. 컴퓨터 등 정보통신 설비의 보수/업그레이드/점검/교체/고장, 통신장애, 해킹 등으로 정상적인 이용이 어려운 경우</li>
                                            <li>2. 정전, 제반 설비의 장애 또는 이용량의 폭주 등으로 정상적인 이용에 지장이 있는 경우</li>
                                            <li>3. 국가비상사태 등 기타 불가항력적 사유가 발생한 경우</li>
                                        </ol>
                                    </li>
                                    <li>② 회사는 전항의 사유로 서비스의 이용을 중단 또는 제한하고자 하는 경우에는 홈페이지, 서면, 전자우편, SMS 중 1가지 이상의 방법을 통해
                                        3영업일 이전에
                                        그 사유와 내용을 사전에 회원에게 통지합니다. 다만, 전산 장애 발생 등의 불가피한 사유로 긴급하게 이용을 중단하거나 제한할 필요가 있는
                                        경우에는 사유 발생
                                        즉시 공지하거나 통지할 수 있습니다.</li>
                                    <li>③ 회사는 서비스 이용의 일시 중단 상태가 해소되는 경우 사유 발생 당일에 홈페이지, 서면, 전자우편, SMS 중 1가지 이상의 방법을 통해
                                        회원께
                                        알려드립니다.</li>
                                </ol>
                                <h4 class="t-tit1">제 11조 (서비스 이용 정지 및 해지)</h4>
                                <ol>
                                    <li>① 회사는 회원에게 다음 각 호의 어느 하나에 해당하는 사유가 있는 경우 이메일을 통해 사유 발생 당일 고지 후 DataBada 홈페이지를 통한
                                        서비스 이용을
                                        정지할 수 있습니다. 단, 개별 계약에서 정한 사유가 있다면 해당 시에도 정지할 수 있습니다.
                                        <ol>
                                            <li>1. 회원의 고의·과실로 인해 법령 또는 이 약관을 위반하여 계약의 목적 달성이 어려운 경우</li>
                                            <li>2. 신청 내용의 필수 기재사항 등 중요 기재사항을 허위로 작성한 경우</li>
                                            <li>3. 이용정지·해지 등 회원이 서비스를 정상적으로 이용할 수 없는 경우</li>
                                            <li>4. 회원의 암호화된 동일인 식별정보(이하 "CI")가 효력을 상실하거나 회원이 CI 수집 활용 동의를 철회한 경우</li>
                                            <li>5. 바이러스 프로그램 유포, 해킹 등 부정한 방법을 사용하여 회사에 피해발생이 우려되거나 피해가 발생 한 경우</li>
                                            <li>6. 서비스의 이용 목적을 벗어난 회원 개인의 영리목적 또는 부정한 방법으로 이용한 경우</li>
                                        </ol>
                                    </li>
                                    <li>② 회사는 회원의 서비스 이용 정지 상태가 해소되는 경우 사유 발생 당일에 이메일을 통해 회원에게 안내합니다.</li>
                                    <li>③ 서비스 이용계약의 해지는 개별 계약에서 정한 사항을 따릅니다.</li>
                                    <li>④ 제 11조 제1항의 조치에 대하여 회원은 회사에 이의 신청을 할 수 있으며, 이의 신청이 적당하다고 회사가 인정하는 경우에 회사는 즉시
                                        서비스의 이용을
                                        재개하여야 합니다.</li>
                                </ol>
                                <h4 class="t-tit1">제 12조 (양도 및 증여)</h4>
                                <p>회원은 서비스의 이용권한, 기타 이용 계약상 지위를 타인에게 양도, 증여할 수 없습니다.</p>
                                <h3 class="t-tit0">제 4장 계약당사자의 의무</h3>
                                <h4 class="t-tit1">제 13조 (회사의 의무)</h4>
                                <p>회사는 본 약관에서 정한 바에 따라 지속적, 안정적으로 서비스를 제공합니다.</p>
                                <h4 class="t-tit1">제 14조 (회원의 의무)</h4>
                                <ol>
                                    <li>① 회원은 반드시 본인명의로만 서비스를 이용해야 하며, 아이디(ID) 및 비밀번호에 대한 관리책임은 회원에게 있으며, 회원은 어떠한 경우에도
                                        본인의
                                        아이디(ID) 또는 비밀번호를 타인에게 양도, 대여, 누설 또는 노출하거나 이와 유사한 행위를 해서는 아니됩니다.</li>
                                    <li>② 회원이 아이디(ID) 또는 비밀번호를 도난당하거나 제3자가 무단으로 이를 사용하고 있음을 인지한 경우, 이를 즉시 회사에 통보하여야 하고,
                                        회사의 안내가
                                        있는 경우에는 그에 따라야 합니다.</li>
                                    <li>③ 회원이 퇴사 및 부서이동으로 인하여 이용 서비스에 대한 접근 권한이 중단 또는 변경 되어야하는 경우 이를 회사에 통보 해야합니다.</li>
                                    <li>④ 회사의 귀책사유에 의하지 아니한 아이디(ID) 또는 비밀번호의 유출, 양도, 대여로 인한 손실 및 손해에 대하여 회사는 아무런 책임을 지지
                                        않습니다.
                                    </li>
                                    <li>⑤ 회원은 계약으로 인해 수신된 데이터를 계약 목적에 한하여 사용해야하며, 외부 유출 등으로부터 안전하게 관리해야 합니다.</li>
                                    <li>⑥ 회원은 관계 법령, 본 약관의 규정 등을 준수하여야 합니다.</li>
                                    <li>⑦ 본 조의 의무를 고의 또는 중과실로 위반하여 발생하는 책임의 전부 또는 일부는 회원에게 있습니다.</li>
                                </ol>
                                <h4 class="t-tit1">제 15조 (회원의 개인정보 보호)</h4>
                                <ol>
                                    <li>① 회사는 관련법령이 정하는 바에 따라서 회원 등록정보를 포함한 회원의 개인정보를 보호합니다. 회원의 개인정보 보호에 관련된 사항은 관련 법령
                                        및 회사가
                                        정하는 개인정보 처리방침 에 정한 바에 의합니다.</li>
                                    <li>② 회사는 회원 탈회 후 중요 정보는 계약 정보 관리를 위하여 삭제하지 않습니다.</li>
                                    <li>③ 회사는 회원의 개인정보 보호를 위하여 관리자의 수를 최소한으로 한정하며, 회원의 개인 정보의 분실, 도난 유출 등으로 야기된 회원의 손해에
                                        대해 책임을
                                        부담합니다. 단, 회사가 고의 또는 과실이 없음을 증명한 경우에는 그러하지 아니합니다.</li>
                                    <li>④ 회사는 관련 법령에서 정한 바에 따라 회원의 정보를 관리하여야 하며, 이에 대한 세부적인 내용은 회사의 개인정보취급방침에 정한 바에
                                        따릅니다. 회사는
                                        개인정보취급방침에 대한 세부 내용을 DataBada 홈페이지에 게시하여 회원이 확인할 수 있도록 합니다.</li>
                                </ol>
                                <h4 class="t-tit1">제 16조 (지식재산권의 귀속 및 이용제한)</h4>
                                <ol>
                                    <li>① 회사가 작성한 저작물에 대한 저작권 기타 지식재산권은 회사에 귀속합니다.</li>
                                    <li>② 회원은 DataBada를 이용함으로써 얻은 정보 중 회사에게 지적재산권이 귀속된 정보를 회사의 사전 승낙 없이 복제, 송신, 출판, 배포,
                                        방송 기타
                                        방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.</li>
                                </ol>
                                <h3 class="t-tit0">제 5장 손해배상 등</h3>
                                <h4 class="t-tit1">제 17조 (관할법원)</h4>
                                <p>이 약관에 따른 거래에 관하여 분쟁이 발생하는 경우에는 회원의 주소지 또는 영업소 소재지를 관할하는 법원을 제1심 관할법원으로 합니다.</p>
                                <h4 class="t-tit1">제 18조 (약관에서 정하지 아니한 사항)</h4>
                                <p>본 약관에서 정하지 아니한 사항과 본 약관의 해석에 관하여는 전자금융거래법 등 관계법령, 상관례, 표준 전자금융거래기본약관에 따릅니다.</p>
                                <h4 class="t-tit1">부칙</h4>
                                <p>1. 본 약관은 2024년 7월 1일부터 시행합니다.</p>
                            </div>
                        </div>
                        <div class="popup-foot">
                            <div class="btn-popwrap">
                                <v-btn 
                                @click="terms = false" 
                                variant="flat" 
                                color="primary" 
                                size="x-large" 
                                rounded="md"
                                class="default"
                                >
                                    확인
                                </v-btn>
                            </div>
                        </div>
                        <v-btn 
                        @click="terms = false" 
                        variant="text" 
                        class="btn-popup-close"
                        >
                            <span class="sr-only">닫기</span>
                        </v-btn>
                    </div>
                    <!-- // 서비스 이용약관 -->
                </v-dialog>

            </v-col>
        </v-row>
        <v-row>
            <h2 class="sub-title">휴대폰본인확인이용동의</h2>
            <v-col cols="12">
                <v-dialog v-model="agree">
                    <!-- 샘플 버튼 -->
                    <template v-slot:activator="{ props: activatorProps }">
                        <v-btn v-bind="activatorProps">
                            휴대폰 본인확인 이용 동의 팝업
                        </v-btn>
                    </template>
                    <!-- // 샘플 버튼 -->

                    <!-- 휴대폰 본인확인 이용 동의 -->
                    <div class="popup-wrap large">
                        <div class="popup-head">
                            <h3 class="h-title">휴대폰 본인확인 이용 동의</h3>
                        </div>
                        <div class="popup-cont">
                            <v-card flat rounded="0" class="tab-cont">
                                <v-tabs v-model="tab" bg-color="transparent" color="selected">
                                    <v-tab value="tab01_1">NICE평가정보</v-tab>
                                    <v-tab value="tab01_2">KCB</v-tab>
                                </v-tabs>
                                <v-window v-model="tab">
                                    <v-window-item value="tab01_1">
                                        <v-card flat rounded="0">
                                            <v-card-text>
                                                <!-- https://devprj2-www.shinhancard.com/pconts/html/agree/1217932_7911.html -->
                                                제1조 (목적)<br>
                                                본 약관은 NICE평가정보(주) (이하 "회사"라 한다)이 제공하는 본인확인서비스(이하 "서비스"라 한다)에 관한 이용조건 및
                                                절차 등 기본적인
                                                사항을 규정함을 목적으로 합니다.<br><br>
                                                제2조 (약관의 효력 및 변경)<br>
                                                1. 본 약관은 "이용자"에게 "서비스" 화면에 게시하거나, 기타의 방법으로 공지하는 것으로 효력이 발생합니다.<br>
                                                2. "회사"는 약관의 규제에 관한 법률 및 기타 관련 법령에 위배되지 않는 범위에서 본 약관의 내용을 개정할 수 있으며, 변경된
                                                경우에는
                                                제1항과 같은 방법으로 공지합니다. 다만 "이용자"의 권리와 의무에 관한 중요한 사항은 변경된 내용의 시행 15일 이전에
                                                공지합니다.<br>
                                                3. "이용자"는 변경된 약관에 대한 내용을 알지 못하여 발생하는 손해 및 피해에 대해서는 "회사"가 책임을 지지
                                                않습니다.<br><br>
                                                제3조 (약관 외 준칙)<br>
                                                본 약관에 명시되지 아니한 사항에 대해서는 정보통신망 이용 촉진 및 정보보호 등에 관한 법률등 기타 관련 법령 또는 상관례에
                                                따릅니다.<br><br>
                                                제4조 (용어의 정의)<br>
                                                본 약관에서 사용하는 용어의 정의는 다음과 같습니다.<br>
                                                1. "본인확인서비스"라 함은 "이용자"가 인터넷상에서 휴대폰 등의 인증수단을 이용하여, 본인임을 안전하게 식별 및 확인해 주는
                                                서비스를
                                                말합니다.<br>
                                                2. "이용자"라 함은 "회사"에서 제공하는 "서비스"의 이용을 위해 자신의 "본인확인정보"를 "회사" 및 "본인확인기관" 등에게
                                                제공하고,
                                                본인임을 확인 받고자 하는 자를 말합니다.<br>
                                                3. "본인확인정보"라 함은 "이용자"가 입력한 생년월일, 성별, 성명, 내/외국인, 휴대폰번호, 통신사 등 본인 식별에 필요한
                                                "이용자"의
                                                정보를 말합니다.<br>
                                                4. "본인확인기관"이라 함은 주민등록번호를 사용하지 아니하고 본인을 확인하는 방법 또는 서비스를 제공하는 자로
                                                방송통신위원회로부터
                                                본인확인기관으로 지정을 받은 자를 의미합니다.<br>
                                                5. "인터넷사업자"라 함은 인터넷을 이용하여 정보를 제공하거나, 정보의 제공을 매개하는 일을 업으로 하는 자로 "회사"와 계약을
                                                통해
                                                운영하며, 인터넷 웹사이트의 "이용자"에 대한 "본인확인정보"를 제공 받는 사업체를 말합니다.<br>
                                                6. "중복가입확인정보"라 함은 웹사이트에 가입하고자 하는 이용자의 중복 확인을 위해 제공되는 정보를 말합니다.<br>
                                                7. "연계정보" 라 함은 "인터넷사업자"의 온·오프라인 서비스 연계 등의 목적으로 "이용자"를 식별하기 위해 제공되는 정보를
                                                말합니다.<br><br>
                                                제5조 (회사의 의무)<br>
                                                1. "회사"는 "서비스" 제공과 관련하여 인지한 "이용자"의 "본인확인정보"를 본인의 승낙 없이 제3자에게 누설하거나 배포하지
                                                않습니다. 단,
                                                국가기관의 요구가 있는 경우, 범죄에 대한 수사상의 목적이 있는 경우 등 기타 관계법령에서 정한 절차에 따른 요청이 있는 경우에는
                                                그러하지
                                                않습니다.<br>
                                                2. "회사"는 "이용자"에게 안전한 "서비스" 제공을 위하여 지속적으로 "서비스"의 예방점검, 유지보수 등을 이행하며,
                                                "서비스"의 장애가
                                                발생하는 경우, 이를 지체 없이 수리 및 복구합니다.<br>
                                                3. "회사"는 "이용자"가 제기한 의견, 불만이 타당하다고 인정되는 경우 적절한 절차를 거쳐 이를 지체 없이 처리하거나 처리에
                                                관한 일정을
                                                통지하여야 합니다.<br>
                                                4. "회사"는 접근매체의 발급 주체가 아닌 경우에는 접근 매체의 위조나 변조로 발생한 사고로 인하여, "이용자"에게 발생한
                                                손해에 대하여
                                                배상책임이 없습니다.<br><br>
                                                제6조 (이용자의 의무)<br>
                                                1. "이용자"는 "서비스"를 이용함에 있어서 다음 각호에 해당하는 행위를 하여서는 안되며, "회사"는 위반 행위에 따르는 일체의
                                                법적 책임을
                                                지지 않습니다.<br>
                                                1) 타 "이용자"의 "본인확인정보"를 부정하게 사용 및 도용하는 행위<br>
                                                2) "회사"의 저작권, 제3자의 저작원 등 기타 권리를 침해하는 행위<br>
                                                3) 범죄 행위<br>
                                                4) 기타 관련 법령에 위배되는 행위<br>
                                                2. "이용자"는 자신의 접근매체를 제3자에게 누설 또는 노출하거나 방치하여서는 안되며, 접근 매체의 도용이나 위조 또는 변조를
                                                방지하기 위하여
                                                충분한 주의를 기울여야 합니다.<br>
                                                3. "이용자"는 본 약관에서 규정하는 사항과 "서비스"에 대한 이용안내 또는 주의사항을 준수하여야 합니다.<br><br>
                                                제7조 (서비스의 내용)<br>
                                                1. "서비스"는 "이용자"가 주민등록번호의 입력 없이, 본인명의로 된 인증수단(휴대폰 등)을 이용하여 본인 확인이 가능한 인증
                                                서비스
                                                입니다.<br>
                                                2. "인터넷사업자"는 회원가입, ID/PW찾기, 성인인증, 기타 본인확인이 필요한 컨텐츠 요청 시 "이용자"에게 "서비스"를
                                                제공
                                                합니다.<br>
                                                3. "이용자"는 자신의 생년월일, 성명, 성별, 내/외국인, 휴대폰번호, 통신사 등의 정보를 입력 후, 입력한 정보가 일치한
                                                경우 해당
                                                휴대폰번호로 1회성 비밀번호(승인번호)가 발송되며, 수신된 승인번호를 정확하게 입력하는 것으로 본인 확인이 이루어
                                                집니다.<br><br>
                                                제8조 (서비스 제공시간)<br>
                                                1. "서비스"의 이용은 연중무휴 1일 24시간을 원칙으로 합니다. 다만, 정기 점검 및 기타 기술상의 이유로 "서비스"가 일시
                                                중지될 수 있고
                                                또한, 운영상의 목적으로 "회사"가 정한 기간에도 일시 중지될 수 있습니다.<br>
                                                2. "회사"는 효율적인 업무 수행을 위하여 필요하다고 판단하는 경우 "서비스"를 일정 범위로 분할 하여 각 범위 별로 이용가능
                                                시간을 달리
                                                정할 수 있으며, 이 경우 그 내용을 공지 합니다.<br><br>
                                                제9조 (서비스 제공의 중지)<br>
                                                1. "회사"는 다음 각 호에 해당하는 사유가 있는 경우 "서비스" 제공의 전부 또는 일부를 중지할 수 있습니다.<br>
                                                1) "서비스"를 위한 설비의 보수 등 공사로 인한 부득이한 경우<br>
                                                2) 정전, 제반 설비의 장애 또는 이용량의 폭주 등으로 정상적인 "서비스" 이용에 지장이 있는 경우<br>
                                                3) "서비스" 계약종료 등과 같은 "인터넷사업자"의 제반 사정으로 "서비스"를 유지할 수 업는 경우<br>
                                                4) 기타 천재지변, 국가비상사태 등 불가항력적 사유가 있는 경우<br>
                                                2. "회사"는 "서비스"의 변경, 중지로 발생하는 문제에 대해서는 어떠한 책임도 지지 않습니다.<br><br>
                                                제10조 (서비스의 안전성 확보)<br>
                                                1. "회사"는 "서비스"의 안전성과 신뢰성을 확보하기 위하여 업무처리지침의 제정 및 시행, 정보처리시스템 및 전산자료의 관리
                                                등의 관리적
                                                조치와 모니터링 체계 및 해킹방지시스템 구축 및 운영 등의 기술적 조치를 취하고 있습니다.<br>
                                                2. "회사"는 서버 및 통신기기의 정상작동여부 확인을 위하여 정보처리시스템 자원 상태의 감시, 경고 및 제어가 가능한 모니터링
                                                체계를 갖추고
                                                있습니다.<br>
                                                3. "회사"는 해킹 침해 방지를 위하여 다음 각 호의 시스템 및 프로그램을 설치하여 운영합니다.<br>
                                                1) 침입차단시스템 설치<br>
                                                2) 침입탐지시스템 설치<br>
                                                3) 그 밖에 필요한 보호장비 또는 암호프로그램 등 정보보호시스템 설치<br>
                                                4. "회사"는 컴퓨터바이러스 감염을 방지하기 위하여 다음 각 호를 포함한 대책을 수립, 운영하고 있습니다.<br>
                                                1) 출처, 유통경로 및 제작자가 명확하지 아니한 응용프로그램은 사용을 자제하고 불가피할 경우에는 컴퓨터바이러스 검색프로그램으로
                                                진단 및 치료
                                                후 사용할 것<br>
                                                2) 컴퓨터바이러스 검색, 치료 프로그램을 설치하고 최신 버전을 유지할 것<br>
                                                3) 컴퓨터바이러스 감염에 대비하여 방어, 탐색 및 복구 절차를 마련할 것<br><br>
                                                제11조 (이용자의 개인정보보호)<br>
                                                "회사"는 관련법령이 정하는 바에 따라서 "이용자"의 개인정보를 보호하기 위하여 노력합니다. "이용자"의 개인정보보호에 관한
                                                사항은 관련법령 및
                                                "회사"가 정하는 "개인정보처리방침"에 정한 바에 따릅니다.<br><br>
                                                제12조 (개인정보의 위탁)<br>
                                                "회사"는 수집된 개인정보의 취급 및 관리 등의 업무를 스스로 수행함을 원칙으로 하나, 필요한 경우 업무의 일부 또는 전부를
                                                "회사"가 선정한
                                                회사에 위탁할 수 있습니다. 개인정보의 위탁에 관한 사항은 관련법령 및 "회사"가 정하는 "개인정보처리방침"에 정한 바에
                                                따릅니다.<br><br>
                                                제13조 (손해배상)<br>
                                                "회사"는 "서비스"의 이용과 관련하여 "이용자"에게 발생한 "회사"측의 중과실에 의한 손해를 제외한 어떠한 손해에 관하여도
                                                책임을 지지
                                                않습니다.<br><br>
                                                제14조 (회사와 인터넷사업자와의 관계)<br>
                                                1. "회사"는 "인터넷사업자"가 제공하는 서비스 상품 또는 용역 등에 대하여 보증책임을 지지 않습니다.<br>
                                                2. "회사"와 "인터넷사업자"는 독자적으로 사이트를 운영하며, "인터넷사업자"와 "이용자"간에 행해진 거래에 대하여 고의 또는
                                                중과실이 있는
                                                경우를 제외하고는 어떠한 책임도 지지 않습니다.<br><br>
                                                제15조 (면책)<br>
                                                1. "회사"의 고의 또는 과실 없이 "서비스"를 제공할 수 없는 경우에는 "서비스" 제공에 관한 책임이 면제됩니다.<br>
                                                2. "회사"는 "이용자" 또는 제3자 측의 사정으로 인한 "서비스" 이용의 장애에 대하여 책임을 지지 않습니다.<br>
                                                3. "회사"는 고의 또는 중과실이 없는 한 "이용자"가 "서비스"를 이용하여 기대하는 수익을 상실한 것에 대하여 책임을 지지
                                                않으며 그밖에
                                                "서비스"를 통하여 얻은 자료로 인한 손해에 관하여 책임을 지지 않습니다.<br>
                                                4. "회사"는 "이용자"가 "서비스"에 게재한 정보, 자료, 사실의 신뢰도, 정확성 등 내용에 관하여는 고의 또는 중과실이 없는
                                                한 일체의
                                                책임을 지지 않습니다.<br>
                                                5. 계약만료 또는 요금 미납의 결과로 사용자계정이 정지되거나, 보관 파일이 삭제된 후 이에 따르는 손해에 대하여 책임을 지지
                                                않습니다.<br><br>
                                                제16조 (관할 법원)<br>
                                                1. "회사"와 "이용자"는 "서비스"와 관련하여 분쟁이 발생한 경우, 원만하게 해결하기 위하여 필요한 모든 노력을 하여야
                                                합니다.<br>
                                                2. 제1항의 협의에서도 분쟁이 해결되지 않은 경우 등, 약관과 관련하여 분쟁으로 인한 소송이 제기될 경우 동 소송은
                                                서울중앙지방법원을 관할
                                                법원으로 합니다.<br><br>
                                                부칙<br>
                                                (시행일) 이 약관은 공시한 날로부터 시행합니다.
                                            </v-card-text>
                                        </v-card>
                                    </v-window-item>
                                    <v-window-item value="tab01_2">
                                        <v-card flat rounded="0">
                                            <v-card-text>
                                                <!-- https://devprj2-www.shinhancard.com/pconts/html/agree/1217919_7911.html -->
                                                제1조 (목적)<br>
                                                이 약관은 본인확인서비스 대행기관인 주식회사 코리아크레딧뷰로(이하 ''회사''라 합니다)와 본인확인서비스 이용자(이하
                                                ''이용자''라 합니다)
                                                간에 본인확인서비스 이용에 관한 회사와 이용자의 권리와 의무, 기타 제반 사항을 정함을 목적으로 합니다.<br><br>
                                                제2조 (용어의 정리)<br>
                                                ① "본인확인서비스"라 함은 이용자가 유무선 인터넷의 웹사이트 및 스마트폰 Application 등(이하 "사이트"라
                                                합니다.)에서 본인 명의로
                                                개통한 휴대폰을 이용하여, "본인확인정보"를 입력하고 인증 절차를 통하여 본인 여부와 본인이 등록한 정보의 정확성을 확인하여 주는
                                                서비스를
                                                말합니다.<br>
                                                ② "본인확인정보"라 함은 이용자가 입력한 본인의 생년월일, 성별, 성명, 내/외국인 여부, 이동통신사, 본인명의로 개통된
                                                휴대폰번호, 기타
                                                본인확인기관과 이용자간에 별도로 설정한 번호 등 "이용자"의 본인 여부 확인에 필요한 정보를 말합니다.<br>
                                                ③ "이용자"라 함은 "사이트"에서 본인확인기관이 제공하는 "본인확인서비스"를 이용하는 자를 말합니다.<br>
                                                ④ "본인확인기관"이라 함은 "본인확인서비스" 관련 법령에 따라 주민등록번호를 수집 이용하고, "사이트"에서 주민등록번호를
                                                사용하지 아니하고
                                                본인을 확인할 수 있도록 해주는 방법을 개발 제공 관리하는 업무를 담당하는 사업자를 말합니다.<br>
                                                ⑤ "대행기관"은 본인확인기관을 대신하여 "이용자"가 "사이트"에서 "본인확인서비스"를 제공받을 수 있도록 "사이트"와
                                                본인확인기관간의
                                                "본인확인서비스"를 중계하고 "이용자"에게 이용방법의 안내와 문의 등 지원업무를 담당하여서, "사이트"에서 "이용자"에게
                                                "본인확인서비스"를
                                                대행하여 제공하는 사업자를 말합니다.<br>
                                                ⑥ "사이트"라 함은 유무선 인터넷의 Web사이트, 스마트폰 Application(Apps)을 통하여 "이용자"에게 서비스,
                                                Contents,
                                                Point 등의 각종 재화와 용역을 유/무료로 제공하는 사업자 및 기관, 단체를 말합니다.<br><br>
                                                제3조 (약관의 명시 및 변경)<br>
                                                ① 회사는 본 약관을 서비스 초기 화면에 게시하여 이용자가 본 약관의 내용을 확인할 수 있도록 합니다.<br>
                                                ② 회사는 필요하다고 인정되는 경우 본 약관을 변경할 수 있으며, 회사가 약관을 변경할 경우에는 적용일자 및 변경사유를 명시하여
                                                서비스 화면에
                                                적용일자 14일 전부터 공지합니다.<br>
                                                ③ 회사가 전항에 따라 변경 약관을 공지 또는 통지하면서 이용자에게 약관 변경 적용일 까지 거부의사를 표시하지 않으면 약관의
                                                변경에 동의한
                                                것으로 간주한다는 내용을 명확하게 공지 또는 통지하였음에도 이용자가 명시적으로 약관 변경에 대한 거부의사를 표시하지 아니하면
                                                이용자가 변경
                                                약관에 동의한 것으로 간주합니다.<br>
                                                ④ 이용자 또는 사이트가 변경된 약관에 대한 내용을 알지 못하여 발생하는 손해 및 피해에 대해서는 회사는 일체 책임을 지지
                                                않습니다.<br>
                                                ⑤ 회사의 약관은 개인정보보호 등을 규정한 정보통신 이용촉진 및 정보보호 등에 관한 법률 등 관련 법령에서 정한 절차와 범위
                                                내에서만
                                                유효합니다.<br><br>
                                                제4조 (본인확인서비스 제공시간)<br>
                                                ① 본인확인서비스의 이용은 연중무휴 1일 24시간을 원칙으로 합니다. 다만, 정기 점검 및 기타 기술상의 이유, 기타 운영상의
                                                사유와 목적에
                                                따라 회사가 정한 기간에 일시 중지될 수 있으며, 각 사이트의 기술상, 운영상의 사유와 목적에 따라 일시 중지될 수
                                                있습니다.<br>
                                                ② 회사는 본인확인서비스 중지에 따라 이용자에게 별도의 보상은 하지 않습니다.<br><br>
                                                제5조 (회사의 권리와 의무)<br>
                                                ① 회사는 본인확인서비스 대행과 관련하여 인지한 이용자의 본인확인정보를 본인의 승낙 없이 제3자에게 누설하거나 배포하지 않습니다.
                                                단,
                                                국가기관의 요구가 있는 경우, 범죄에 대한 수사상의 목적이 있는 경우 등 기타 관계 법령에서 정한 절차에 따른 요청이 있는
                                                경우에는 그러하지
                                                않습니다.<br>
                                                ② 회사는 이용자에게 안정적인 본인확인서비스 대행을 위하여 지속적으로 관련 시스템이나 절차, 기능 등의 예방점검, 유지보수 등을
                                                이행하며,
                                                본인확인서비스의 장애가 발생하는 경우, 이를 지체 없이 수리 및 복구합니다.<br>
                                                ③ 회사는 서비스의 안전성과 신뢰성, 보안성을 확보하기 위하여 개인정보 처리시스템의 해킹방지시스템 및 보안관리 체계 운영 등
                                                기술적, 관리적
                                                조치를 취합니다.<br>
                                                ④ 회사는 서버 및 통신기기의 정상작동여부 확인을 위하여 정보처리시스템 자원 상태의 감시, 경고 및 제어가 가능한 모니터링 체계를
                                                갖춥니다.<br>
                                                ⑤ 회사는 해킹 침해 방지를 위하여 다음 각 호의 시스템 및 프로그램을 설치하여 운영합니다.<br>
                                                1. 침입 차단 및 탐지시스템 설치<br>
                                                2. 그 밖에 필요한 보호장비 또는 암호프로그램 등 정보보호시스템 설치<br>
                                                ⑥ 회사는 컴퓨터바이러스 감염을 방지하기 위하여 바이러스 방지 대책을 자체적으로 운영합니다.<br><br>
                                                제6조 (이용자의 권리와 의무)<br>
                                                ① 이용자는 서비스를 이용함에 있어서 다음 각호에 해당하는 행위를 하여서는 안되며, 회사는 위반 행위에 따르는 일체의 법적 책임을
                                                지지
                                                않습니다.<br>
                                                1. 본인이 아닌 타인의 본인확인정보를 부정하게 사용 및 도용하는 행위<br>
                                                2. 회사 및 본인확인기관, 사이트의 저작권, 제3자의 저작권 등 기타 권리를 침해하는 행위<br>
                                                3. 법령에 규정하는 제반 범죄 및 위법 행위<br>
                                                ② 이용자는 본 약관에서 규정하는 사항과 서비스에 대한 이용안내 또는 주의사항 등을 준수하여야 합니다.<br>
                                                ③ 이용자는 이용자 본인의 접근매체, 본인확인정보의 분실, 유출, 누설없이 본인 스스로 성실히 관리하여야 합니다.<br>
                                                ④ 이용자는 회사의 서비스 고객센터를 통하여 관련 문의를 할 수 있습니다.<br>
                                                《회사의 서비스 고객센터 연락처 : 02-708-1000, www.ok-name.co.kr》<br>
                                                ⑤ 이용자는 본인확인서비스가 자신의 의사에 반하여 특정 사이트에 제공되었음을 안 때에는 본인확인기관 또는 회사를 통하여 자신의
                                                본인확인정보
                                                삭제를 요구할 수 있으며, 본인확인기관 또는 회사는 그 정정요구를 받은 날부터 2주 이내에 처리 결과를 알려 주어야
                                                합니다.<br>
                                                《회사의 서비스 고객센터 연락처 : 02-708-1000, www.ok-name.co.kr》<br><br>
                                                제7조 (이용자의 개인정보보호)<br>
                                                ① 회사는 본인확인서비스를 대행함에 있어 취득한 이용자의 정보 또는 자료를 이용자의 동의 없이 제3자에게 제공, 누설하거나 업무상
                                                목적 외에
                                                사용하지 않습니다.<br>
                                                ② 이용자의 개인정보 보호는 회사가 관련 법령과 회사가 수립하여 운영하는 개인정보 취급방침에 따릅니다. 자세한 회사의 개인정보
                                                제공 범위와 보호
                                                방침, 위탁은 서비스 홈페이지(www.ok-name.co.kr)에 제공되는 개인정보 취급방침을 참조하시기 바랍니다.<br><br>
                                                제8조 (약관 외 준칙)<br>
                                                본 약관에 명시되지 아니한 사항에 대해서는 정보통신망 이용 촉진 및 정보보호 등에 관한 법률 등 기타 관련 법령 또는 상관례에
                                                따릅니다.<br><br>
                                                부칙<br>
                                                (시행일) 이 약관은 공시한 날로부터 시행합니다.
                                            </v-card-text>
                                        </v-card>
                                    </v-window-item>
                                </v-window>
                            </v-card>
                        </div>
                        <v-btn 
                        @click="agree = false" 
                        variant="text" 
                        class="btn-popup-close"
                        >
                            <span class="sr-only">닫기</span>
                        </v-btn>
                    </div>
                    <!-- // 휴대폰 본인확인 이용 동의 -->
                </v-dialog>
            </v-col>
        </v-row>
        <v-row>
            <h2 class="sub-title">기업찾기</h2>
            <v-col cols="12">
                <v-dialog v-model="company" persistent>
                    <!-- 샘플 버튼 -->
                    <template v-slot:activator="{ props: activatorProps }">
                        <v-btn 
                        v-bind="activatorProps"
                        >
                            기업찾기 팝업
                        </v-btn>
                    </template>
                    <!-- // 샘플 버튼 -->
                    <!-- 기업찾기 -->
                    <div class="popup-wrap large fixed">
                        <div class="popup-head">
                            <h3 class="h-title">기업찾기</h3>
                        </div>
                        <div class="popup-cont">
                            <v-card flat rounded="0" class="tab-cont">
                                <v-tabs v-model="tab" bg-color="transparent" color="selected" class="tab-search">
                                    <v-tab value="tab01_1">기업명 검색</v-tab>
                                    <v-tab value="tab01_2">사업자등록번호 검색</v-tab>
                                </v-tabs>
                                <v-window v-model="tab">
                                    <v-window-item value="tab01_1">
                                        <v-card flat rounded="0" class="search-cont">
                                            <v-card-text>
                                                <div class="search-area">
                                                    <div class="input-wrap">
                                                        <v-text-field placeholder="기업명 입력" title="기업명 입력"
                                                            variant="outlined" color="primary" hide-details="auto"
                                                            clearable></v-text-field>
                                                        <v-btn block class="btn-search">
                                                            <span class="sr-only">검색</span>
                                                        </v-btn>
                                                    </div>
                                                </div>
                                                <div class="table-wrap">
                                                    <ul class="table-head">
                                                        <li class="bo-select">선택</li>
                                                        <li class="bo-name">기업명</li>
                                                        <li class="bo-num">사업자등록번호</li><!-- 2024.05.21 컬럼명 수정 -->
                                                        <li class="bo-email">법인도메인</li><!-- 2024.05.21 컬럼명 수정 -->
                                                    </ul>
                                                    <v-radio-group hide-details="auto">
                                                        <ul class="table-body">
                                                            <!-- 검색 안내 -->
                                                            <li class="no-data">
                                                                <p class="title">기업 검색</p>
                                                                <p class="text">기업 검색을 해주시기 바랍니다.</p>
                                                            </li>               
                                                        </ul>
                                                    </v-radio-group>
                                                </div>
                                            </v-card-text>
                                        </v-card>
                                    </v-window-item>
                                    <v-window-item value="tab01_2">
                                        <v-card flat rounded="0" class="search-cont">
                                            <v-card-text>
                                                <div class="search-area">
                                                    <div class="input-wrap">
                                                        <v-text-field placeholder="[-] 없이 숫자만 입력"
                                                            title="사업자등록번호 숫자 10자리 입력" 
                                                            variant="outlined"
                                                            color="primary" hide-details="auto"
                                                            clearable></v-text-field>
                                                        <v-btn 
                                                        block 
                                                        class="btn-search"
                                                        >
                                                            <span class="sr-only">검색</span>
                                                        </v-btn>
                                                    </div>
                                                </div>
                                                <div class="table-wrap">
                                                    <ul class="table-head">
                                                        <li class="bo-select">선택</li>
                                                        <li class="bo-name">기업명</li>
                                                        <li class="bo-num">사업자등록번호</li><!-- 2024.05.21 컬럼명 수정 -->
                                                        <li class="bo-email">법인도메인</li><!-- 2024.05.21 컬럼명 수정 -->
                                                    </ul>
                                                    <v-radio-group hide-details="auto">
                                                        <ul class="table-body">
                                                            <!-- 검색 안내 -->
                                                            <li class="no-data">
                                                                <p class="title">기업 검색</p>
                                                                <p class="text">기업 검색을 해주시기 바랍니다.</p>
                                                            </li>                                                            
                                                        </ul>
                                                    </v-radio-group>
                                                </div>
                                            </v-card-text>
                                        </v-card>
                                    </v-window-item>
                                </v-window>
                                <v-card-text class="info-area">
                                    <p class="info-tip">
                                        법인 사업자 계정으로 가입하시려면 법인 이메일 주소가 필요합니다.<br>
                                        법인 이메일이 없으신 경우, 개인 계정으로 가입 후 고객센터로 문의 해 주시기 바랍니다.
                                    </p>
                                    <div class="info-title">
                                        <p class="info-text">소속 기업이 등록되어있지 않다면?</p>
                                        <v-btn 
                                        variant="outlined" 
                                        color="Outlinded" 
                                        size="x-small" 
                                        rounded="md"
                                        class="text-outlinded"
                                        >
                                            기업 추가
                                        </v-btn>
                                    </div>
                                </v-card-text>
                            </v-card>
                        </div>
                        <div class="popup-foot">
                            <div class="btn-popwrap">
                                <v-btn 
                                variant="flat" 
                                color="primary" 
                                size="x-large" 
                                rounded="md" 
                                class="default"
                                >
                                    확인
                                </v-btn>
                            </div>
                        </div>
                        <v-btn 
                        @click="company = false" 
                        variant="text" 
                        class="btn-popup-close"
                        >
                            <span class="sr-only">닫기</span>
                        </v-btn>
                    </div>
                    <!-- // 기업찾기 -->
                </v-dialog>
            </v-col>
        </v-row>
        <v-row>
            <h2 class="sub-title">휴면해제 안내</h2>
            <v-col cols="12">
                <v-dialog v-model="alarm" width="auto">
                    <!-- 샘플 버튼 -->
                    <template v-slot:activator="{ props: activatorProps }">
                        <v-btn v-bind="activatorProps">
                            휴면계정 알림 팝업
                        </v-btn>
                    </template>
                    <!-- // 샘플 버튼 -->

                    <!-- 휴면계정 알림 -->
                    <div class="popup-wrap small">
                        <div class="popup-head">
                            <h3 class="h-title">휴면계정안내</h3><!-- 2024.06.14 알림 -> 안내 제목 수정 -->
                        </div>
                        <div class="popup-cont">
                            <p class="alarm">고객님의 계정이 오랜시간 동안 접속되지 않아 휴면 상태로 전환되었습니다.<br>계속해서 서비스를 이용하시려면 본인인증을 진행해주세요.
                            </p>
                            <!-- 2024.06.14 내용 추가 -> 진행 -->
                        </div>
                        <div class="popup-foot">
                            <div class="btn-popwrap">
                                <v-btn 
                                variant="flat" 
                                color="secondary" 
                                size="large" 
                                rounded="md" 
                                class="cancel"
                                >
                                    취소
                                </v-btn>
                                <v-btn 
                                variant="flat" 
                                color="primary" 
                                size="large" 
                                rounded="md" 
                                class="default"
                                >
                                    확인
                                </v-btn>
                            </div>
                        </div>
                    </div>
                    <!-- // 휴면계정 알림 -->
                </v-dialog>
            </v-col>
        </v-row>
        <v-row>
            <h2 class="sub-title">메인공지 팝업</h2>
            <v-col cols="12">
                <v-dialog v-model="noticePopup" width="auto">
                    <!-- 샘플 버튼 -->
                    <template v-slot:activator="{ props: activatorProps }">
                        <v-btn v-bind="activatorProps">
                            메인공지 팝업
                        </v-btn>
                    </template>
                    <!-- // 샘플 버튼 -->

                    <!-- 메인공지 팝업  -->
                    <div class="popup-wrap x-medium main-notice-popup">
                        <div class="popup-cont">
                            <swiper 
                            :loop="true" 
                            :spaceBetween="24" 
                            :autoplay="{
                                delay: 2500,
                                disableOnInteraction: false,
                            }" 
                            :speed="1000" 
                            :pagination="{
                                clickable: true,
                            }" 
                            :navigation="navigation" 
                            :modules="[Autoplay, Pagination, Navigation]"
                            >
                                <swiper-slide>
                                    <!--이미지 배너 케이스-->
                                    <a href="javascript:;">
                                        <div class="pop-bg-notice"><img
                                                src="../../../assets/images/main/banner_notice01.png" alt=""></div>
                                    </a>
                                </swiper-slide>
                                <swiper-slide>
                                    <a href="javascript:;">
                                        <!--배경이미지+텍스트 케이스-->
                                        <div class="pop-bg-notice"><img
                                                src="../../../assets/images/main/bg-notice-type2.png" alt=""></div>
                                        <div class="pop-notice-text">
                                            <strong class="pop-notice-title">제목크기 40px 한줄 제한</strong>
                                            <p class="pop-notice-cont">
                                                컨텐츠 텍스트는 관리자에서 등록<br>
                                                글자수 제한 있으나, 본 텍스트 영역 이상의 줄바꿈 또는 글자수가 초과될 시 영역밖의 내용은 보이지 않음.<br>
                                                글자 영역의 높이깂은 반드시 지켜져야 합니다.<br>
                                                그래야 모바일 팝업에서도 동일한 양의 글자가 노출될 수 있습니다.<br>
                                                일이삼사오육칠팔구십일이삼사오육<br>
                                                칠팔구십일이삼사오육칠팔구십일이삼사오육칠팔구
                                            </p>
                                        </div>
                                    </a>
                                </swiper-slide>
                                <swiper-slide>
                                    <a href="javascript:;">
                                        <!--배경이미지+텍스트 케이스-->
                                        <div class="pop-bg-notice"><img
                                                src="../../../assets/images/main/bg-notice-type1.png" alt=""></div>
                                        <div class="pop-notice-text">
                                            <strong class="pop-notice-title">제목크기 40px 한줄 제한</strong>
                                            <p class="pop-notice-cont">
                                                컨텐츠 텍스트는 관리자에서 등록<br>
                                                글자수 제한 있으나, 본 텍스트 영역 이상의 줄바꿈 또는 글자수가 초과될 시 영역밖의 내용은 보이지 않음.<br>
                                                글자 영역의 높이깂은 반드시 지켜져야 합니다.<br>
                                                그래야 모바일 팝업에서도 동일한 양의 글자가 노출될 수 있습니다.<br>
                                                일이삼사오육칠팔구십일이삼사오육<br>
                                                칠팔구십일이삼사오육칠팔구십일이삼사오육칠팔구
                                            </p>
                                        </div>
                                    </a>
                                </swiper-slide>
                            </swiper>
                            <div class="indicator-wrap">
                                <button type="button" class="btn-main-prev" ref="prevEl">
                                    <span class="sr-only">이전</span>
                                </button>
                                <button type="button" class="btn-main-next" ref="nextEl">
                                    <span class="sr-only">다음</span>
                                </button>
                            </div>
                        </div>
                        <div class="popup-foot">
                            <v-btn 
                            variant="text" 
                            class="pop-1day-close">
                                오늘 그만보기
                            </v-btn>
                            <v-btn 
                            @click="noticePopup = false" 
                            variant="text" 
                            class="pop-notice-close">
                                닫기
                            </v-btn>
                        </div>
                    </div>
                    <!-- // 비밀번호 확인 -->
                </v-dialog>
            </v-col>
        </v-row>
    </div>
</template>
<script setup>
import { ref } from 'vue';
import { reactive, onMounted } from 'vue'
import PopupAlert from '@/views/pub/Components/PopupAlert.vue'
import { Swiper, SwiperSlide } from 'swiper/vue';
import { Autoplay, Pagination, Navigation} from 'swiper/modules';
import 'swiper/css';
import 'swiper/css/pagination';
import "swiper/css/navigation";
const confirm = ref(false);
const terms = ref(false);
const tab = ref(null);
const agree = ref(false);
const company = ref(false);
const alarm = ref(false);
const noticePopup = ref(false);
const prevEl = ref(null);
const nextEl = ref(null);
const navigation = reactive({
  prevEl: prevEl,
  nextEl: nextEl,
});



// 
let dialogInfo = reactive({
    text: '',
    toggle: false
})
// 템플릿 시작될때
onMounted(() => {
    dialogInfo.text = '인증이 완료 되었습니다.'
    dialogInfo.toggle = true
})
// 오픈팝업
const openPopup = () => {
    dialogInfo.text = '인증이 완료 되었습니다.'
    dialogInfo.toggle = true
}
// 크로즈팝업
const closePopup = () => {
    dialogInfo.toggle = false
}
</script>
<style scoped>
.guide-wrap {
    padding: 4rem;
    margin: 0 auto;
    max-width: 128rem;

    .sub-title {
        padding: 1rem 0;
        font-size: 2rem;
    }

    .member {
        padding: 0;
        max-width: 100%;
    }

    .v-row+.v-row {
        margin-top: 5rem;
    }
}
</style>